---
title: <h0>2/03 cisco virtal cloud</h0>
author: cotes   
categories: [cisco virtual cloud]
tags: [Network]




---

# 6.1 EtherChannel Operation



**LACP:** 

​	•	표준 프로토콜이므로 다양한 벤더의 장비와 혼합하여 사용할 때 유리합니다.

**PAgP:**

​	•	Cisco 장비만 사용하는 환경에서 최적화되어 있습니다.

------



물리 인터페이스는 설정이 동일해야함

```
int f0/1
channel-group 3 mode
int f0/2
channel-group 3 mode
--------------------------------

int port-channel 3
```

sw mo trunk 둘을 trunk 로 만들겠다



------

## 6.1.7 PAgP(port aggregation rpotocol - cisco) Mode Settings

 

```
  auto       Enable PAgP only if a PAgP device is detected
  desirable  Enable PAgP unconditionally
  
SW1(config-if)#channel-group 3 mode auto
SW1(config-if)#channel-group 3 mode desirable
```

장점 

* 로드 벨런싱 가능

* 모든 링크가 사용할 수 있음

### LACP: link aggregation conrtrol protocol (표준)

```
  active     Enable LACP unconditionally
  passive    Enable LACP only if a LACP device is detected
  
  SW1(config-if)#channel-group 3 mode active
  SW1(config-if)#channel-group 3 mode passive
```

양쪽을 passive로 하면 동작하지 않음



------

# 6.2 Configure EtherChannel

![image-20250203120355488](/Users/changhee/2WindowLight.github.io/_posts/images/2025-02-03-cisco/image-20250203120355488.png)

**1단계.** **interface range** *interface* global configuration mode 명령을 사용하여 EtherChannel 그룹을 구성하는 인터페이스를 지정합니다 . **range** 키워드를 사용하면 여러 인터페이스를 선택하여 모두 함께 구성할 수 있습니다.

**2단계. 인터페이스 범위 구성 모드에서** **channel-group** *identifier* **mode active** 명령 으로 포트 채널 인터페이스를 만듭니다 . 식별자는 채널 그룹 번호를 지정합니다. **mode active** 키워드는 이를 LACP EtherChannel 구성으로 식별합니다.

**3단계.** 포트 채널 인터페이스에서 레이어 2 설정을 변경하려면 **interface port-channel** 명령을 사용하여 포트 채널 인터페이스 구성 모드로 들어간 다음 인터페이스 식별자를 입력합니다. 이 예에서 S1은 LACP EtherChannel로 구성됩니다. 포트 채널은 허용된 VLAN이 지정된 트렁크 인터페이스로 구성됩니다.

```
S1(config)# interface range FastEthernet 0/1 - 2
S1(config-if-range)# channel-group 1 mode active
Creating a port-channel interface Port-channel 1
S1(config-if-range)# exit
S1(config)# interface port-channel 1
S1(config-if)# switchport mode trunk
S1(config-if)# switchport trunk allowed vlan 1,2,20
```



------

## 6.3.1 Verify EtherChannel



### 6.3.2 Common Issues with EtherChannel Configurations

다음은 EtherChannel 구성 시 핵심 사항과 흔한 문제들을 요약한 내용입니다.

​	•	**일관된 포트 설정:**

모든 EtherChannel에 포함된 포트는 반드시 동일한 속도, 듀플렉스 모드, 그리고

​	•	트렁크 포트인 경우: 동일한 native VLAN 및 허용 VLAN 범위

​	•	액세스 포트인 경우: 동일한 액세스 VLAN

으로 설정되어야 합니다.

​	•	**주요 문제점:**

​	1.	**VLAN 불일치:**

​	•	EtherChannel에 할당된 포트들이 동일한 VLAN에 속하지 않거나, 모두 트렁크로 설정되지 않은 경우(서로 다른 native VLAN은 EtherChannel을 형성할 수 없습니다).

​	2.	**트렁크 설정 불일치:**

​	•	EtherChannel에 포함된 포트 중 일부에만 트렁크 모드가 설정된 경우 문제가 발생할 수 있으므로, EtherChannel 단위로 트렁크 모드를 확인해야 합니다.

​	3.	**허용 VLAN 범위 차이:**

​	•	각 포트의 허용 VLAN 범위가 다르면 PAgP 모드(auto 또는 desirable)여도 EtherChannel이 형성되지 않습니다.

​	4.	**동적 협상 옵션 불일치:**

​	•	양쪽 장비에서 PAgP 또는 LACP의 동적 협상 옵션이 일치하지 않으면 EtherChannel이 제대로 구성되지 않습니다.

​	•	**프로토콜 구분:**

​	•	**PAgP와 LACP:** EtherChannel(링크 집계)을 자동으로 구성하는 프로토콜입니다.

​	•	**DTP:** 트렁크 링크 자동 구성을 위한 프로토콜로, EtherChannel 구성 후에 적용하는 것이 일반적입니다.



이렇게 모든 설정이 일관되게 이루어지면 EtherChannel 관련 네트워크 문제를 크게 줄일 수 있습니다.



------



## 6.3.3 Troubleshoot EtherChannel Example

![image-20250203144224437](/Users/changhee/2WindowLight.github.io/_posts/images/2025-02-03-cisco/image-20250203144224437.png)

그림에서 스위치 S1과 S2의 인터페이스 F0/1과 F0/2는 EtherChannel에 연결되어 있습니다. 그러나 EtherChannel은 작동하지 않습니다.



2. 인터페이스 포트 채널의 결과 조회

```
S1# show run | begin interface port-channel
interface Port-channel1
 switchport trunk allowed vlan 1,2,20
 switchport mode trunk
!
interface FastEthernet0/1
 switchport trunk allowed vlan 1,2,20
 switchport mode trunk
 channel-group 1 mode on
!
interface FastEthernet0/2
 switchport trunk allowed vlan 1,2,20
 switchport mode trunk
 channel-group 1 mode on
!======================================
S2# show run | begin interface port-channel
interface Port-channel1
 switchport trunk allowed vlan 1,2,20
 switchport mode trunk
!
interface FastEthernet0/1
 switchport trunk allowed vlan 1,2,20
 switchport mode trunk
 channel-group 1 mode desirable
!
interface FastEthernet0/2
 switchport trunk allowed vlan 1,2,20
 switchport mode trunk
 channel-group 1 mode desirable


```

sw1 과 sw2 의 포트 설정에 문제가 있다. on , desirable

3. PAgP mode on the EtherChannel is changed to desirable - on 에서 desirable 로 변경

```
S1(config)# no interface port-channel 1
S1(config)# interface range fa0/1 - 2
S1(config-if-range)# channel-group 1 mode desirable
Creating a port-channel interface Port-channel 1
S1(config-if-range)# no shutdown
S1(config-if-range)# exit
S1(config)# interface port-channel 1
S1(config-if)# switchport mode trunk
S1(config-if)# end
S1# 
```

------

## Module 7: DHCPv4



## 7.1.1 DHCPv4 Server and Client

![image-20250203163206643](/Users/changhee/2WindowLight.github.io/_posts/images/2025-02-03-cisco/image-20250203163206643.png)

​	•	**DHCPv4란?**

​		DHCPv4(Dynamic Host Configuration Protocol v4)는 네트워크에 연결된 장치에 IPv4 주소와 기타 설정 정보를 자동으로 할당해 주는 프로토콜입니다.

​	•	**왜 유용한가?**

​		대부분의 네트워크 노드가 데스크탑 컴퓨터와 같이 많기 때문에, DHCPv4를 사용하면 관리자가 일일이 수동으로 주소를 설정할 필요가 없어 시간을 크게 절약할 수 있습니다.

​	•	**전용 서버 vs. 라우터 사용**

​	•	**전용 DHCPv4 서버:**

​			확장성이 좋고 관리가 쉬워 큰 네트워크에서 유리합니다.

​	•	**Cisco 라우터:**

​			작은 지점이나 SOHO 환경에서는 별도의 서버 없이 Cisco 라우터가 DHCPv4 서비스를 제공할 수 있습니다. Cisco IOS는 완전한 기능을 갖춘 DHCPv4 서버를 옵션으로 지원합니다.

​	**주소 임대(lease) 방식**

​	•	DHCPv4 서버는 미리 정해진 주소 풀에서 임시로(일정 기간 동안) 주소를 할당합니다.

​	•	클라이언트는 관리자가 설정한 임대 기간(보통 24시간에서 1주일 이상) 동안 이 주소를 사용합니다.

​	•	임대 기간이 끝나면 클라이언트는 새로운 주소를 요청하지만, 보통 같은 주소가 다시 할당됩니다.

------

## 7.1.3 Steps to Obtain a Lease

다음은 DHCP가 IP 주소를 할당하기 위해 수행하는 4단계 과정

**DHCP Discover (DHCPDISCOVER)**

**클라이언트가 “나 IP가 필요해!“라고 방송 메시지를 보냅니다.**- IP 주소가 없는 클라이언트가 네트워크에 연결되면, 모든 장비에 “DHCP 서버 있나요?“라는 메시지를 브로드캐스트로 보냅니다.

**DHCP Offer (DHCPOFFER)**	

**DHCP 서버가 “내가 IP 주소 하나 줄게!“라고 응답합니다.**- DHCP 서버들은 클라이언트의 요청을 받고, 사용 가능한 IP 주소와 함께 서브넷 마스크, 게이트웨이, DNS 등 네트워크 설정 정보를 포함한 제안을 보냅니다.

**DHCP Request (DHCPREQUEST)**	

**클라이언트가 “나는 이 주소로 할게요!“라고 선택합니다.**- 여러 제안 중 하나를 선택한 클라이언트는 선택한 DHCP 서버에 다시 브로드캐스트 메시지로 “이 IP 주소로 주세요”라고 요청합니다.- 다른 DHCP 서버들에게도 자신이 선택한 사실을 알립니다.

**DHCP Acknowledgment (DHCPACK)**	

**DHCP 서버가 “알겠어요, 이 주소는 이제 당신 거예요!“라고 확인합니다.**- 선택된 DHCP 서버는 클라이언트의 요청을 확인하는 메시지를 보내며, 이로써 클라이언트는 해당 IP 주소와 설정 정보를 사용하게 됩니다.



이 과정은 클라이언트가 네트워크에 연결될 때 자동으로 IP 주소를 받아 사용할 수 있도록 하는 ‘대화(협상)’ 과정이라고 이해하면 된다.

![image-20250203163624751](/Users/changhee/2WindowLight.github.io/_posts/images/2025-02-03-cisco/image-20250203163624751.png)



------

## 7.2.1 Cisco IOS DHCPv4 Server

![image-20250203163935738](/Users/changhee/2WindowLight.github.io/_posts/images/2025-02-03-cisco/image-20250203163935738.png)

### Steps to Configure

**Step 1. Exclude IPv4 Addresses**

DHCPv4 서버로 작동하는 라우터는 특정 주소를 제외하도록 구성되지 않은 한 DHCPv4 주소 풀의 모든 IPv4 주소를 할당합니다.

 일반적으로 풀의 일부 IPv4 주소는 정적 주소 할당이 필요한 네트워크 장치에 할당됩니다. 따라서 이러한 IPv4 주소는 다른 장치에 할당해서는 안 됩니다.

```bash
Router(config)# ip dhcp excluded-address low-address [high-address]
```



**Step 2. Define a DHCPv4 Pool Name**



**Step 3. Configure the DHCPv4 Pool**

------

## 7.2.3 Configuration Example

![image-20250203164515994](/Users/changhee/2WindowLight.github.io/_posts/images/2025-02-03-cisco/image-20250203164515994.png)

```bash
R1(config)# ip dhcp excluded-address 192.168.10.1 192.168.10.9
R1(config)# ip dhcp excluded-address 192.168.10.254
R1(config)# ip dhcp pool LAN-POOL-1
R1(dhcp-config)# network 192.168.10.0 255.255.255.0
R1(dhcp-config)# default-router 192.168.10.1
R1(dhcp-config)# dns-server 192.168.11.5
R1(dhcp-config)# domain-name example.com
R1(dhcp-config)# end
R1#
```



------

## 7.2.4 DHCPv4 Verification Commands



------

## 7.2.5 Verify DHCPv4 is Operational



------

## 7.2.7 Disable the Cisco IOS DHCPv4 Server

```bash
R1(config)# no service dhcp
R1(config)# service dhcp
R1(config)#
```

DHCPv4 서비스는 기본적으로 활성화되어 있습니다. 서비스를 비활성화하려면 **no service dhcp** global configuration mode 명령을 사용

* DHCP 바인딩을 지우거나 DHCP 서비스를 중지했다가 다시 시작하면 네트워크에 일시적으로 중복 IP 주소가 할당될 수 있다.



------

## 7.2.8 DHCPv4 Relay

![image-20250203165448386](/Users/changhee/2WindowLight.github.io/_posts/images/2025-02-03-cisco/image-20250203165448386.png)



**ip helper-address**

```
R1(config)# interface g0/0/0
R1(config-if)# ip helper-address 192.168.11.6
R1(config-if)# end
R1#
```



------

## 7.2.9 Other Service Broadcasts Relayed



- Port 37: Time

ntp(network time protocol)

- Port 49: TACACS - 인증 서버
- Port 53: DNS
- Port 67: DHCP/BOOTP server
- Port 68: DHCP/BOOTP client
- Port 69: TFTP - 유니캐스트 베이스
- Port 137: NetBIOS name service
- Port 138: NetBIOS datagram service



------

# 7.3 Configure a DHCPv4 Client



## 7.3.2 Configuration Example

이더넷 인터페이스를 DHCP 클라이언트로 구성하려면 예에서와 같이 **ip address dhcp** interface configuration mode 명령을 사용합니다. 이 구성은 ISP가 선택된 고객에게 IPv4 주소 정보를 제공하도록 구성되었다고 가정합니다.

```bash
SOHO(config)# interface G0/0/1
SOHO(config-if)# ip address dhcp
SOHO(config-if)# no shutdown
Sep 12 10:01:25.773: %DHCP-6-ADDRESS_ASSIGN: Interface GigabitEthernet0/0/1 assigned DHCP address 209.165.201.12, mask 255.255.255.224, hostname SOHO

```

show **ip interface g0/0/1** 명령은 인터페이스가 작동 중이고 주소가 DHCPv4 서버에서 할당되었는지 확인합니다.

```bash
SOHO# show ip interface g0/0/1
GigabitEthernet0/0/1 is up, line protocol is up
  Internet address is 209.165.201.12/27
  Broadcast address is 255.255.255.255
  Address determined by DHCP
(output omitted)

```

