---
title: <h0>02/10 cisco</h0>
author: cotes   
categories: [cisco virtual cloud]
tags: [Network]












---

## 5.1.5 Numbered Standard IPv4 ACL Example

패킷을 제어하는데 소스 ip 만으로 해결 



------

## 5.2.1 Two Methods to Modify an ACL

**ACL(Access Control List)은 여러 개의 ACE(Access Control Entries)를 포함할 수 있으며, 설정이 복잡할 수 있습니다.**

**초기에 예상한 필터링 결과와 다를 경우, ACL을 수정해야 합니다. 이를 위해 두 가지 방법이 주로 사용됩니다.**

**1. 텍스트 편집기(Text Editor) 사용**

✔ **ACL을 수동으로 재구성하고 적용하는 방법**



1️⃣ **현재 ACL 확인**

```
show access-lists
```

​	•	기존 ACL을 확인하여 어떤 ACE가 설정되어 있는지 분석



2️⃣ **ACL을 삭제하고 새로운 ACL을 생성**

```
no access-list 1
access-list 1 deny host 19.168.10.10
access-list 1 permit 192.168.10.0 0.0.0.255
```

​	•	**기존 ACL을 삭제하고 새롭게 설정**

​	•	**수정이 필요할 경우, 전체 ACL을 삭제 후 다시 입력해야 함**

**2. 시퀀스 번호(Sequence Numbers) 사용**

✔ **ACL 내 특정 ACE를 수정하거나 삭제하는 방법**



1️⃣ **현재 ACL의 시퀀스 번호 확인**

```
show access-lists
```

​	•	각 ACE는 특정 시퀀스 번호(예: 10, 20, 30)로 구분됨



2️⃣ **특정 시퀀스 번호의 ACE 삭제**

```
ip access-list standard 10
no 20
```

​	•	시퀀스 번호 20에 해당하는 ACE만 삭제



3️⃣ **새로운 ACE 추가**

```
ip access-list standard 10
25 permit 192.168.2.0 0.0.0.255
```

​	•	시퀀스 번호 25에 새로운 ACE 추가

​	•	기존 ACE 순서를 유지하면서 필요한 항목만 변경 가능

결과 보기

```bash
Router(config)#do sh run | section acc
access-list 1 deny host 192.168.10.10
access-list 1 permit 192.168.10.0 0.0.0.255
```

**✅ 결론**

✔ **텍스트 편집기 방식** → ACL을 삭제 후 재구성 (비효율적이지만 확실한 방법)

✔ **시퀀스 번호 방식** → 특정 항목만 수정 가능 (더 효율적인 방식)

✔ **상황에 따라 적절한 수정 방법 선택하여 사용** 

------

## 5.2.2 Text Editor Method



```bash
R1# show run | section access-list
access-list 1 deny 19.168.10.10
access-list 1 permit 192.168.10.0 0.0.0.255
R1#
```





------

## 5.2.3 Sequence Numbers Method

**📌 시퀀스 번호(Sequence Numbers) 방식**



✅ **ACL의 ACE(Access Control Entries)는 자동으로 시퀀스 번호가 할당됨**

✅ **show access-lists 명령어로 시퀀스 번호 확인 가능 (show running-config에는 표시되지 않음)**

✅ **ACE를 수정하려면 기존 시퀀스 번호를 먼저 삭제하고 다시 추가해야 함**

**✅ ACL 시퀀스 번호 수정 예시**



1. **현재 ACL 확인**

```bash
R1# show access-lists
Standard IP access list 1
    10 deny 19.168.10.10  ❌ (잘못된 IP)
    20 permit 192.168.10.0 0.0.0.255
```

2. **잘못된 ACE(시퀀스 10) 삭제 및 수정**

```bash
R1(config)# ip access-list standard 1
R1(config-std-nacl)# no 10
R1(config-std-nacl)# 10 deny host 192.168.10.10
R1(config-std-nacl)# end
```

3.  **변경 사항 확인**

```bash
R1# show access-lists
Standard IP access list 1
    10 deny 192.168.10.10  ✅ (수정 완료)
    20 permit 192.168.10.0 0.0.0.255
```



✔ **ACL 수정 시, 같은 시퀀스 번호를 덮어쓸 수 없으므로 먼저 삭제 후 다시 추가해야 함**

✔ **show access-lists로 시퀀스 번호를 확인하고 no <번호>로 특정 ACE 삭제 가능**

✔ **이 방법을 사용하면 전체 ACL을 삭제하지 않고도 부분 수정 가능** 🚀



------

ACL

1. standard access list: **source ip**  기준으로 filtering
   - numbered ACL
   - named ACL
2. extended access list: **src ip, dst ip, src port, dst port, protocol** 기준으로 filtering
   - numbered ACL
   - named ACL



------

## 5.2.4 Modify a Named ACL Example

**Named ACL 수정 (시퀀스 번호 활용)**



✅ **Named ACL에서도 시퀀스 번호를 사용하여 ACE(Access Control Entries) 추가 및 삭제 가능**

✅ **새로운 ACE를 추가할 때, 적절한 시퀀스 번호를 사용해야 기존 ACL 규칙이 올바르게 적용됨**

✅ **IOS는 최적화를 위해 host 엔트리를 자동 정렬함**

**✅ Named ACL 수정 예시**



1️⃣ **현재 ACL 확인**

```
R1# show access-lists
Standard IP access list NO-ACCESS
    10 deny 192.168.10.10
    20 permit 192.168.10.0, wildcard bits 0.0.0.255
```

2️⃣ **새로운 ACE(시퀀스 15) 추가**

```
R1(config)# ip access-list standard NO-ACCESS
R1(config-std-nacl)# 15 deny 192.168.10.5
R1(config-std-nacl)# end
```

3️⃣ **변경 사항 확인**

```
R1# show access-lists
Standard IP access list NO-ACCESS
    15 deny 192.168.10.5
    10 deny 192.168.10.10
    20 permit 192.168.10.0, wildcard bits 0.0.0.255
```

**✅ 결론**



✔ **시퀀스 번호를 활용해 특정 위치에 ACE 추가 가능**

✔ **IOS는 성능 최적화를 위해 host 엔트리를 자동 정렬함**

✔ **전체 ACL을 삭제하지 않고도 수정 가능** 



------

## 5.2.5 ACL Statistics

**📌 ACL 통계(Statistics) **



✅ **show access-lists 명령어를 사용하면 ACL의 각 ACE(Access Control Entry)가 몇 번 일치했는지 확인 가능**

✅ **암시적 deny any는 통계에 표시되지 않으므로, 명시적으로 deny any를 추가해야 차단된 패킷 수를 확인할 수 있음**

✅ **clear access-list counters 명령어를 사용하면 ACL 통계를 초기화 가능**

**✅ ACL 통계 예시**



1️⃣ **현재 ACL 통계 확인**

```
R1# show access-lists
Standard IP access list NO-ACCESS
    10 deny   192.168.10.10 (20 matches)
    20 permit 192.168.10.0, wildcard bits 0.0.0.255 (64 matches)
```

​	•	**192.168.10.10을 차단한 횟수: 20번**

​	•	**192.168.10.0/24을 허용한 횟수: 64번**



2️⃣ **ACL 통계 초기화**

```
R1# clear access-list counters NO-ACCESS
```

3️⃣ **초기화 후 확인**

```
R1# show access-lists
Standard IP access list NO-ACCESS
    10 deny   192.168.10.10
    20 permit 192.168.10.0, wildcard bits 0.0.0.255
```

​	•	**기록이 초기화되어 일치 횟수가 사라짐**

**✅ 결론**



✔ **ACL 통계를 확인하면 특정 규칙이 얼마나 자주 적용되는지 분석 가능**

✔ **deny any를 명시적으로 추가해야 차단된 패킷 수도 확인 가능**

✔ **clear access-list counters 명령어로 통계를 초기화 가능** 



------

## 5.3.1 The access-class Command



------

## 5.3.2 Secure VTY Access Example

![image-20250210123738332](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210123738332.png)



```bash
R1(config)# username ADMIN secret class
R1(config)# ip access-list standard ADMIN-HOST
R1(config-std-nacl)# remark This ACL secures incoming vty lines
R1(config-std-nacl)# permit 192.168.10.10
R1(config-std-nacl)# deny any
R1(config-std-nacl)# exit
R1(config)# line vty 0 4
R1(config-line)# login local  // 로컬 계정을 사용해서 들어옴
R1(config-line)# transport input telnet
R1(config-line)# access-class ADMIN-HOST in
R1(config-line)# end
R1#

```



```bash
R1(config)# line vty 0 4
R1(config-line)# login local
R1(config-line)# transport input ssh
R1(config-line)# access-class ADMIN-HOST in
R1(config-line)# end
R1#

```



------



## 5.4.1 Extended ACLs

​	•	**표준 ACL과 확장 ACL의 차이점**

​	•	**표준 ACL**: 오직 **출발지 IP 주소**만을 기준으로 트래픽을 필터링합니다.

​	•	**확장 ACL**:

​	•	**출발지 주소**, **목적지 주소**, **프로토콜**(예: IP, TCP, UDP, ICMP), **포트 번호** 등 다양한 기준으로 트래픽을 필터링할 수 있습니다.

​	•	이로 인해 더 정밀한 트래픽 제어가 가능하며, 예를 들어 이메일 트래픽은 허용하지만 파일 전송이나 웹 브라우징은 차단하는 식으로 설정할 수 있습니다.

​	•	**ACL 생성 방법**

​	•	**번호가 있는 확장 ACL**: access-list [ACL 번호] 명령어를 사용하여 생성합니다.

​	•	**이름이 있는 확장 ACL**: ip access-list extended [ACL 이름] 명령어를 사용하여 생성합니다.



즉, 표준 ACL은 간단하지만 필터링 조건이 제한적이며, 보다 세밀한 제어가 필요할 때는 확장 ACL을 사용하여 다양한 조건에 따른 트래픽 필터링을 수행할 수 있습니다.



------

## 5.4.2 Numbered Extended IPv4 ACL Syntax

**5.4.2 번호가 있는 확장 IPv4 ACL 구문**

확장 ACL을 구성하는 절차는 표준 ACL과 동일합니다. 먼저 확장 ACL을 구성한 후 인터페이스에 활성화합니다. 그러나 확장 ACL이 제공하는 추가 기능을 지원하기 위해 명령어 구문과 매개변수가 더 복잡합니다.



번호가 있는 확장 ACL을 생성하려면 다음 글로벌 구성 명령어를 사용합니다:

```bash
Router(config)# access-list access-list-number {deny | permit | remark text} protocol source source-wildcard [operator {port}] destination destination-wildcard [operator {port}] [established] [log]
```

확장 ACL을 제거하려면 다음 글로벌 구성 명령어를 사용합니다:

```
Router(config)# no access-list access-list-number
```

확장 ACL에는 많은 키워드와 매개변수가 있지만, 확장 ACL을 구성할 때 모든 키워드를 사용할 필요는 없습니다. 표는 확장 ACL 구문의 세부적인 설명을 제공합니다.



확장 IPv4 ACL을 인터페이스에 적용하는 명령어는 표준 IPv4 ACL을 적용하는 명령어와 동일합니다.

```
Router(config-if)# ip access-group {access-list-number | access-list-name} {in | out}
```

인터페이스에서 ACL을 제거하려면 먼저 no ip access-group 인터페이스 구성 명령어를 입력해야 합니다. ACL을 라우터에서 제거하려면 no access-list 글로벌 구성 명령어를 사용합니다.



**참고**: 표준 ACL 문장에 적용되는 내부 논리는 확장 ACL에는 적용되지 않습니다. 즉, 구성하는 동안 입력한 문장의 순서가 그대로 표시되고 처리됩니다.



## **1.1.1.0/24에서 10.10.10.0/24로 가는 HTTP(포트 80) 트래픽을 허용 규칙

**ACL 명령어 설명**

```
access-list 100 permit tcp 1.1.1.0 0.0.0.255 10.10.10.0 0.0.0.255 eq 80
```

이 명령어는 **확장(Extended) ACL**을 생성하는 것으로, 특정 트래픽을 허용하는 규칙을 정의합니다. 각각의 요소를 분석하면 다음과 같습니다.

1. **access-list 100**

​	•	100은 ACL 번호이며, 100~199 사이의 숫자는 **확장 ACL**을 의미합니다.

​	•	이 ACL은 여러 개의 규칙을 가질 수 있으며, ACL 번호를 기반으로 관리됩니다.

2. **permit**

​	•	해당 규칙에 맞는 트래픽을 **허용(permit)** 합니다.

​	•	만약 deny였다면 해당 트래픽을 차단하는 규칙이 됩니다.

3. **tcp**

​	•	필터링할 프로토콜을 지정합니다.

​	•	여기서는 **TCP** 프로토콜을 대상으로 합니다.

4. **1.1.1.0 0.0.0.255**

​	•	**출발지 네트워크**를 지정합니다.

​	•	1.1.1.0은 출발지 IP 네트워크 주소이며, 0.0.0.255는 와일드카드 마스크입니다.

​	•	와일드카드 마스크 0.0.0.255는 1.1.1.0부터 1.1.1.255까지의 **256개 IP 주소(서브넷 전체)** 를 포함합니다.

5. **10.10.10.0 0.0.0.255**

​	•	**목적지 네트워크**를 지정합니다.

​	•	10.10.10.0은 목적지 IP 네트워크 주소이며, 0.0.0.255 와일드카드 마스크는 10.10.10.0부터 10.10.10.255까지의 **256개 IP 주소(서브넷 전체)** 를 포함합니다.

6. **eq 80**

​	•	**목적지 포트 번호**를 지정합니다.

​	•	eq 80은 TCP **포트 80(HTTP)** 을 의미합니다.

​	•	즉, **웹 트래픽(HTTP)** 을 필터링 대상으로 지정한 것입니다.



✅ **출발지**: 1.1.1.0/24 네트워크

✅ **목적지**: 10.10.10.0/24 네트워크

✅ **프로토콜**: TCP

✅ **포트**: 목적지 포트 80 (HTTP 트래픽)



------

## 5.4.4 Protocols and Port Numbers Configuration Examples

**5.4.4 프로토콜 및 포트 번호 설정 예제**



확장 ACL은 다양한 **포트 번호(port number)** 와 **포트 이름(port name)** 을 기준으로 트래픽을 필터링할 수 있습니다.



다음 예제에서는 **확장 ACL 100**을 설정하여 **HTTP 트래픽**을 필터링합니다.

​	•	첫 번째 명령어는 **포트 이름(www)** 을 사용합니다.

​	•	두 번째 명령어는 **포트 번호(80)** 를 사용합니다.

​	•	두 명령어는 동일한 결과를 수행합니다.

```
R1(config)# access-list 100 permit tcp any any eq www
R1(config)#  ! 또는...
R1(config)# access-list 100 permit tcp any any eq 80
```

일부 프로토콜(예: SSH, HTTPS)에는 특정 **포트 번호**가 할당되어 있으며, 이 경우 명시적으로 포트 번호를 지정해야 합니다.



다음 예제에서는 **SSH(포트 22)** 와 **HTTPS(포트 443)** 트래픽을 허용하는 확장 ACL을 설정하는 방법을 보여줍니다.

```
R1(config)# access-list 100 permit tcp any any eq 22   # SSH 트래픽 허용
R1(config)# access-list 100 permit tcp any any eq 443  # HTTPS 트래픽 허용
```

**요약**

​	•	**ACL에서 특정 프로토콜을 필터링할 때**

​	•	포트 **이름(www, ssh, https 등)** 을 사용할 수 있음.

​	•	또는 **포트 번호(80, 22, 443 등)** 를 직접 지정할 수도 있음.

​	•	두 방식 모두 같은 효과를 가짐.

​	•	**특정 포트 번호가 할당된 프로토콜(예: SSH, HTTPS)은 명확히 포트 번호를 지정해야 함.**



------

## 5.4.6 TCP Established Extended ACL



![image-20250210130039133](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210130039133.png)

**TCP established 키워드를 사용하면 기본적인 상태 추적 방화벽 기능을 수행할 수 있습니다.**



이 키워드를 사용하면 내부 네트워크에서 **나가는** 트래픽은 허용되며, 이에 대한 **응답 트래픽(ACK 또는 RST 플래그가 설정된 패킷)** 은 다시 들어올 수 있습니다. 하지만, 외부 네트워크에서 **새로운 TCP 연결을 시작하는 것은 차단됩니다.**

**네트워크 토폴로지 설명**



다이어그램에 나와 있는 네트워크는 다음과 같습니다.

​	•	**R1 라우터**가 네트워크의 중심이며, 두 개의 인터페이스를 가짐

​	•	**G0/0/0**: 내부 사설 네트워크(192.168.10.0/24)에 연결

​	•	**G0/0/1**: 외부 공용 네트워크(인터넷)에 연결

​	•	**PC1(내부 네트워크 사용자)** 가 인터넷과 통신

​	•	**ACL 적용 정책**:

​	•	**내부에서 외부로 가는 TCP 요청은 허용됨.**

​	•	**외부에서 내부로 들어오는 TCP 응답(ACK 포함)은 허용됨.**

​	•	**외부에서 내부로의 새로운 TCP 연결은 차단됨.**

**ACL 설정 개요**



네트워크에서 두 개의 ACL을 사용하여 트래픽을 관리합니다.

​	1.	**ACL 110** (내부 → 외부 트래픽 제어)

​	•	내부 네트워크(192.168.10.0/24)에서 웹 트래픽(HTTP, HTTPS) 허용

​	2.	**ACL 120** (외부 → 내부 트래픽 제어)

​	•	established 키워드를 사용하여 **내부에서 시작된 세션에 대한 응답 패킷만 허용**

​	•	외부에서 시작된 새로운 TCP 연결은 차단

**ACL 적용 명령어**

```
R1(config)# access-list 120 permit tcp any 192.168.10.0 0.0.0.255 established
R1(config)# interface g0/0/0
R1(config-if)# ip access-group 120 out
R1(config-if)# end
```

​	•	**ACL 120**:

​	•	permit tcp any 192.168.10.0 0.0.0.255 established

​	•	**내부 네트워크(192.168.10.0/24)로 들어오는 응답 트래픽만 허용**

​	•	ACK 또는 RST 플래그가 있는 TCP 응답 트래픽만 수락

​	•	**인터페이스 G0/0/0에 ACL 적용**

​	•	ip access-group 120 out → **인터페이스에서 나가는 트래픽 필터링**

​	•	내부 네트워크에서 요청한 트래픽만 응답을 받을 수 있도록 설정

**ACL 확인 (트래픽 매칭 결과)**

```
R1# show access-lists
Extended IP access list 110
     10 permit tcp 192.168.10.0 0.0.0.255 any eq www
     20 permit tcp 192.168.10.0 0.0.0.255 any eq 443 (657 matches)
Extended IP access list 120
     10 permit tcp any 192.168.10.0 0.0.0.255 established (1166 matches)
```

​	•	**ACL 110**: 내부에서 **웹(HTTP, HTTPS) 요청을 허용**

​	•	HTTPS(포트 443) 요청이 **657번 허용됨**

​	•	**ACL 120**: 내부에서 시작된 세션의 **응답 트래픽을 허용**

​	•	established 조건을 만족하는 응답 트래픽이 **1166번 허용됨**

**정리**



✅ **내부에서 시작한 TCP 요청은 허용**

✅ **응답 트래픽(ACK/RST 포함)은 허용**

❌ **외부에서 시작한 새로운 TCP 연결은 차단**



**결론**: established 키워드는 **내부 네트워크에서 시작한 트래픽의 응답만 허용**하는 기능을 하므로, 외부에서 무작위로 새로운 연결을 시도하는 공격(예: 포트 스캔, 원치 않는 접속 요청)으로부터 내부 네트워크를 보호할 수 있습니다.



------

## 5.4.7 Named Extended IPv4 ACL Syntax



Naming an ACL makes it easier to understand its function. To create a named extended ACL, use the following global configuration command:



```
Router(config)# ip access-list extended access-list-name
```



This command enters the named extended configuration mode. Recall that ACL names are alphanumeric, case sensitive, and must be unique.

In the example, a named extended ACL called NO-FTP-ACCESS is created and the prompt changed to named extended ACL configuration mode. ACE statements are entered in the named extended ACL sub configuration mode.



```
R1(config)# ip access-list extended NO-FTP-ACCESS
R1(config-ext-nacl)#
```



------

## 5.4.8 Named Extended IPv4 ACL Example





------

## 5.4.9 Edit Extended ACLs





------

## 5.4.11 Verify Extended ACLs



### show ip interface g0/0/0

```
R1# show ip interface g0/0/0
GigabitEthernet0/0/0 is up, line protocol is up (connected)
  Internet address is 192.168.10.1/24
  Broadcast address is 255.255.255.255
  Address determined by setup command
  MTU is 1500 bytes
  Helper address is not set
  Directed broadcast forwarding is disabled
  Outgoing access list is REPLY-PC1
  Inbound  access list is PERMIT-PC1
  Proxy ARP is enabled
  Security level is default
  Split horizon is enabled
  ICMP redirects are always sent
  ICMP unreachables are always sent
  ICMP mask replies are never sent
  IP fast switching is disabled
  IP fast switching on the same interface is disabled
  IP Flow switching is disabled
  IP Fast switching turbo vector
  IP multicast fast switching is disabled
  IP multicast distributed fast switching is disabled
  Router Discovery is disabled
R1#
R1# show ip interface g0/0/0 | include access list
Outgoing access list is REPLY-PC1
Inbound access list is PERMIT-PC1
R1#


```



### show access-lists 

```
R1# show access-lists 
Extended IP access list PERMIT-PC1
    10 permit tcp host 192.168.10.10 any eq ftp-data
    20 permit tcp host 192.168.10.10 any eq ftp
    30 permit tcp host 192.168.10.10 any eq 22
    40 permit tcp host 192.168.10.10 any eq telnet
    50 permit udp host 192.168.10.10 any eq domain
    60 permit tcp host 192.168.10.10 any eq domain
    70 permit tcp host 192.168.10.10 any eq www
    80 permit tcp host 192.168.10.10 any eq 443
    90 deny ip 192.168.10.0 0.0.0.255 any
Extended IP access list REPLY-PC1
    10 permit tcp any host 192.168.10.10 established
R1#
```



### show running-config

```
R1# show running-config | begin ip access-list
ip access-list extended PERMIT-PC1
 remark Permit PC1 TCP access to internet
 permit tcp host 192.168.10.10 any eq ftp-data
 permit tcp host 192.168.10.10 any eq ftp
 permit tcp host 192.168.10.10 any eq 22
 permit tcp host 192.168.10.10 any eq telnet
 permit udp host 192.168.10.10 any eq domain
 permit tcp host 192.168.10.10 any eq domain
 permit tcp host 192.168.10.10 any eq www
 permit tcp host 192.168.10.10 any eq 443
 deny   ip 192.168.10.0 0.0.0.255 any
ip access-list extended REPLY-PC1
 remark Only permit returning traffic to PC1
 permit tcp any host 192.168.10.10 established
!
(output omitted)
!
end 
```



------

# 6.1 NAT Characteristics

------

## 6.1.1 IPv4 Private Address Space

**사설 주소를 공인 주소로 바꿔주는 것**



![image-20250210163914525](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210163914525.png)

✅ **IPv4 공인(public) 주소는 부족함** → 모든 기기에 공인 IP를 할당할 수 없음.

✅ **RFC 1918에서 사설 IP(Private IP) 주소 대역을 정의** → 기업 및 내부 네트워크에서 사용.

✅ **사설 IP는 인터넷에서 라우팅되지 않음** → 외부 통신하려면 **공인 IP로 변환(NAT 필요)**.

**1️⃣ 사설 IPv4 주소란?**

​	•	**공인 IP**: 인터넷에서 직접 사용되는 주소 (예: 8.8.8.8, 203.0.113.5).

​	•	**사설 IP**: 내부 네트워크에서만 사용되는 주소 (인터넷에서 직접 사용 불가).

​	•	**RFC 1918에서 정의한 사설 IP 주소 대역**:

| **클래스** | **사설 IP 범위**              |
| ---------- | ----------------------------- |
| **A**      | 10.0.0.0 - 10.255.255.255     |
| **B**      | 172.16.0.0 - 172.31.255.255   |
| **C**      | 192.168.0.0 - 192.168.255.255 |

**2️⃣ 사설 IP만으로 인터넷을 사용할 수 없는 이유**

​	•	**사설 IP는 특정 기업/조직에 귀속되지 않음** → 인터넷에서 고유한 식별자로 사용 불가능.

​	•	**공인 IP가 있어야 외부 인터넷과 통신 가능**.

​	•	**해결책 → NAT(Network Address Translation) 사용**.

**3️⃣ NAT의 역할 (공인 IP로 변환)**

​	•	**사설 IP → 공인 IP 변환**하여 인터넷 사용 가능하게 함.

​	•	**하나의 공인 IP를 여러 내부 장치가 공유 가능**.

​	•	**IPv4 주소 고갈을 늦추는 핵심 기술**.



✅ **NAT 없이 IPv4 주소 고갈은 2000년 이전에 발생했을 것**.

✅ 하지만 **NAT에도 한계가 있으며, IPv6 도입이 궁극적인 해결책**.

**4️⃣ 결론**

​	•	**사설 IP는 내부 네트워크용, 인터넷에서는 사용 불가**.

​	•	**NAT를 통해 사설 IP를 공인 IP로 변환해야 인터넷 접속 가능**.

​	•	**IPv4 주소 부족 문제 해결을 위해 IPv6로 전환 필요**.



🚀 **NAT 덕분에 IPv4 주소를 더 오래 사용할 수 있었지만, IPv6가 최종 해결책!** 🚀

Source NAT

- static
- dynamic
- PAT



------

## 6.1.2 What is NAT

![image-20250210164145948](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210164145948.png)



------

## 6.1.4 NAT Terminology

![image-20250210164339693](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210164339693.png)

**📌 NAT 주소 유형 (쉽고 직관적으로 정리)**



**✅ NAT(Network Address Translation)란?**

​	•	**내부 네트워크(사설 IP)**와 **외부 네트워크(공인 IP)** 간의 IP 주소 변환 기술

​	•	**목적:** 사설 IP를 공인 IP로 변환하여 인터넷에 접속 가능하게 함

**1️⃣ NAT에서 사용하는 용어**

| **용어**            | **설명**                                          |
| ------------------- | ------------------------------------------------- |
| **Inside (내부)**   | NAT 변환을 받는 **내부 네트워크**                 |
| **Outside (외부)**  | NAT를 통해 통신하는 **외부 네트워크 (인터넷 등)** |
| **Local (로컬)**    | **내부 네트워크에서만 보이는 주소**               |
| **Global (글로벌)** | **외부(인터넷)에서 보이는 공인 주소**             |

**2️⃣ NAT에서 사용하는 4가지 주소 유형**

| **주소 유형**      | **설명**                                 | **예제 (PC1: 192.168.10.10, 웹서버: 209.165.201.1)** |
| ------------------ | ---------------------------------------- | ---------------------------------------------------- |
| **Inside Local**   | 내부 네트워크에서 **사용하는 사설 IP**   | 192.168.10.10 (PC1의 실제 IP)                        |
| **Inside Global**  | **인터넷에서 보이는 변환된 공인 IP**     | 209.165.200.226 (PC1이 NAT를 통해 부여받은 공인 IP)  |
| **Outside Local**  | **내부에서 바라보는 외부 네트워크의 IP** | 209.165.201.1 (웹서버의 IP, 보통 변환되지 않음)      |
| **Outside Global** | **외부 네트워크에서 사용하는 공인 IP**   | 209.165.201.1 (웹서버의 공인 IP, 변경 없음)          |

✅ **핵심 포인트**

​	•	**PC1이 인터넷(웹서버)과 통신할 때, NAT 라우터(R2)가 사설 IP를 공인 IP로 변환함.**

​	•	**웹서버(공인 IP)는 변환 없이 그대로 사용됨.**

​	•	**PC1의 트래픽은 NAT 변환 후, 209.165.200.226(Inside Global) 주소를 사용하여 웹서버에 도달함.**

**3️⃣ NAT 트래픽 흐름 예제**



💡 **PC1(192.168.10.10)이 웹서버(209.165.201.1)로 접속하는 과정**

1️⃣ **PC1 → 웹서버 요청 (사설 IP → 공인 IP 변환)**

​	•	출발지(Source) → Inside Local: 192.168.10.10

​	•	목적지(Destination) → Outside Global: 209.165.201.1

​	•	**NAT 변환 후:**

​	•	출발지(Source) → Inside Global: 209.165.200.226

​	•	목적지(Destination) → Outside Global: 209.165.201.1



2️⃣ **웹서버 → PC1 응답 (공인 IP → 사설 IP 변환)**

​	•	출발지(Source) → Outside Global: 209.165.201.1

​	•	목적지(Destination) → Inside Global: 209.165.200.226

​	•	**NAT 변환 후:**

​	•	출발지(Source) → Outside Local: 209.165.201.1

​	•	목적지(Destination) → Inside Local: 192.168.10.10



✅ **결과:** 웹서버는 PC1의 공인 IP(Inside Global)만 알고 있음 → 보안 강화 효과 있음.

**4️⃣ NAT의 역할**



✅ **사설 IP → 공인 IP 변환 (인터넷 사용 가능)**

✅ **공인 IP 부족 문제 해결 (하나의 공인 IP를 여러 장치가 공유 가능)**

✅ **내부 네트워크 보호 (공인 IP를 감추어 보안 강화 효과 있음)**



🚀 **즉, NAT은 사설 IP를 공인 IP로 변환하여 인터넷 접속을 가능하게 하고, IPv4 주소 부족 문제를 해결하는 핵심 기술!** 🚀



------

## 6.2.1 Static NAT

1대1 매핑 - 라우터에 NAT

![image-20250210164729456](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210164729456.png)

**📌 Static NAT (정적 NAT) 쉽게 정리**



✅ **Static NAT(정적 NAT)란?**

​	•	**내부 IP(사설 IP)와 외부 IP(공인 IP)를 1:1로 매핑하는 방식**

​	•	**네트워크 관리자가 직접 설정한 IP 변환이 항상 유지됨**

​	•	**특정 장치가 인터넷에서 일정한 공인 IP를 가지도록 할 때 사용**

**1️⃣ Static NAT 동작 방식**



💡 **예제:**

| **내부 사설 IP (Inside Local)** | **외부 공인 IP (Inside Global)** |
| ------------------------------- | -------------------------------- |
| 192.168.10.10                   | 209.165.200.226                  |
| 192.168.10.11                   | 209.165.200.227                  |
| 192.168.10.12                   | 209.165.200.228                  |

✅ 내부 IP(192.168.10.10)가 인터넷에 나갈 때 항상 **209.165.200.226**으로 변환됨.

✅ 외부에서 이 공인 IP로 접속하면 **해당 내부 장치로 연결됨**.

**2️⃣ Static NAT이 필요한 경우**



🔹 **웹 서버, 원격 접속(SSH) 등에서 공인 IP가 항상 유지되어야 할 때**

🔹 **회사 서버가 인터넷에서 고정된 IP로 접근 가능해야 할 때**

🔹 **원격 관리자가 특정 공인 IP로 내부 서버에 접근해야 할 때**



예제:

✅ **PC4(인터넷 사용자가 SSH로 서버 접속)**

```
ssh 209.165.200.226
```

✅ **라우터 R2가 해당 IP를 내부 IP(192.168.10.10)로 변환하여 연결**

**3️⃣ Static NAT의 단점**



❌ **사용할 수 있는 공인 IP 개수가 한정됨**

❌ **사용자가 많을 경우 모든 기기에 공인 IP를 할당하기 어려움**

❌ **효율이 낮아 일반 사용자보다는 서버 등에 주로 사용**

**4️⃣ 결론**



✅ **Static NAT은 항상 고정된 IP가 필요한 서버나 네트워크 장치에 적합**

✅ **공인 IP를 내부 IP와 1:1 매핑하여 인터넷에서 접근 가능하게 함**

✅ **하지만 공인 IP가 부족할 경우 많은 기기에 적용하기 어려움**



🚀 **Static NAT은 서버, 원격 관리 장치 등에 사용되며, 일반적인 네트워크에서는 주로 Dynamic NAT 또는 PAT(포트 주소 변환)가 사용됨!** 🚀

------

## 6.2.2 Dynamic NAT

그룹 대 그룹 - 만약 사설 ip 가 10개가 있으면 공인 ip 20개로 





------

## 6.2.3 Port Address Translation

사설 ip 여러개가 공인 ip 하나로 변환

![image-20250210165058561](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210165058561.png)

**📌 Port Address Translation (PAT) 쉽게 정리**



✅ **PAT(Port Address Translation)이란?**

​	•	**여러 개의 사설 IP(Private IP)를 하나의 공인 IP(Public IP)로 변환하는 NAT 방식**

​	•	**라우터는 각 기기의 트래픽을 구분하기 위해 “포트 번호”를 사용**

​	•	**홈 네트워크와 기업 네트워크에서 가장 일반적으로 사용되는 NAT 방식**

**1️⃣ PAT의 동작 방식**



💡 **기본 개념:**

​	•	**하나의 공인 IP(예: 209.165.200.226)를 여러 장치가 공유**

​	•	**각 장치는 고유한 포트 번호를 사용하여 개별 트래픽을 구분**



**📌 예제 (PC1, PC2가 동시에 인터넷 사용)**

| **출발지 (Inside Local IP:Port)** | **변환 후 (Inside Global IP:Port)** | **목적지 (Outside Global IP:Port)** |
| --------------------------------- | ----------------------------------- | ----------------------------------- |
| 192.168.10.10:1555                | 209.165.200.226:1555                | 209.165.201.1:80                    |
| 192.168.10.11:1331                | 209.165.200.226:1331                | 209.165.202.129:80                  |

✅ **PC1(192.168.10.10)이 웹사이트(209.165.201.1:80)에 접속**

✅ **PC2(192.168.10.11)이 다른 웹사이트(209.165.202.129:80)에 접속**

✅ **라우터(R2)가 내부 사설 IP를 하나의 공인 IP(209.165.200.226)로 변환하고, 포트 번호(1555, 1331)로 각 세션을 구분**

**2️⃣ PAT의 장점**



✅ **하나의 공인 IP로 여러 개의 장치가 인터넷 사용 가능** → 공인 IP 절약

✅ **각 장치마다 고유한 포트 번호 사용 → 트래픽을 정확히 매칭 가능**

✅ **보안 기능 제공 (외부에서 내부 IP를 직접 알 수 없음)**

**3️⃣ PAT의 동작 과정**



1️⃣ **PC1과 PC2가 인터넷에 연결 요청 (출발지 주소 포함)**

​	•	**PC1**: 192.168.10.10:1555 → 209.165.201.1:80

​	•	**PC2**: 192.168.10.11:1331 → 209.165.202.129:80



2️⃣ **라우터(R2)가 NAT 변환 수행 (공인 IP로 변경)**

​	•	**PC1**: 209.165.200.226:1555 → 209.165.201.1:80

​	•	**PC2**: 209.165.200.226:1331 → 209.165.202.129:80



3️⃣ **웹 서버 응답 시 포트 번호로 클라이언트 구분하여 전달**

​	•	**웹 서버 응답:**

​	•	209.165.201.1:80 → 209.165.200.226:1555 (PC1로 전달)

​	•	209.165.202.129:80 → 209.165.200.226:1331 (PC2로 전달)

​	•	**라우터가 포트 번호를 보고 올바른 장치로 패킷 전달**

**4️⃣ PAT과 Static NAT 차이점**

| **구분**              | **Static NAT**            | **PAT (NAT Overload)**                                  |
| --------------------- | ------------------------- | ------------------------------------------------------- |
| **IP 변환 방식**      | 1:1 변환 (고정된 IP 매핑) | 다수의 사설 IP를 하나의 공인 IP로 변환 (포트 번호 활용) |
| **공인 IP 필요 개수** | 장치별로 공인 IP 필요     | 하나의 공인 IP만 필요                                   |
| **사용 예제**         | 웹 서버, 원격 접속        | 일반적인 인터넷 사용 (가정, 기업)                       |
| **보안성**            | 낮음 (고정된 IP 사용)     | 높음 (내부 IP 숨김)                                     |

**5️⃣ 결론**



✅ **PAT은 하나의 공인 IP로 여러 장치가 인터넷을 사용할 수 있도록 해줌**

✅ **포트 번호를 활용하여 개별 트래픽을 구분**

✅ **일반 가정, 회사 네트워크에서 가장 많이 사용되는 NAT 방식**



🚀 **즉, 우리가 집에서 인터넷을 사용할 때 여러 기기가 하나의 공인 IP로 인터넷에 접속할 수 있는 것은 PAT 덕분!** 🚀



------

## 6.2.4 Next Available Port

![image-20250210165603537](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210165603537.png)

**📌 PAT의 Next Available Port (다음 사용 가능한 포트) 쉽게 정리**



✅ **문제:** 여러 장치가 **동일한 포트 번호(예: 1444)를 사용하려 하면 충돌 발생 가능**

✅ **해결:** PAT는 **가능하면 원래 포트 번호를 유지**, 하지만 이미 사용 중이면 **새로운 사용 가능한 포트 할당**

✅ **동작 원리:**

​	•	PAT는 **사용 가능한 첫 번째 포트를 찾아 할당**

​	•	사용 가능한 포트 그룹:

​	•	**0-511** (잘 사용되지 않음)

​	•	**512-1023** (예약된 포트)

​	•	**1024-65535** (일반적으로 사용되는 범위)

​	•	포트가 모두 사용되면, **새로운 공인 IP를 할당**하여 NAT 트래픽 유지

**1️⃣ 예제: 두 개의 장치가 같은 포트(1444) 사용하려는 경우**



💡 **PC1과 PC2가 동시에 인터넷 사용, 두 장치 모두 포트 1444를 선택**

| **출발지 (Inside Local IP:Port)** | **변환 후 (Inside Global IP:Port)** | **목적지 (Outside Global IP:Port)** |
| --------------------------------- | ----------------------------------- | ----------------------------------- |
| 192.168.10.11:1444                | 209.165.200.226:1444                | 209.165.201.1:80                    |
| 192.168.10.12:1444                | 209.165.200.226:1445                | 209.165.201.1:80                    |

✅ **라우터는 중복을 방지하기 위해 PC2의 포트를 1445로 변경**

✅ **이제 두 개의 트래픽이 동시에 존재해도 문제 없음**

**2️⃣ 패킷이 돌아올 때의 동작**

​	•	**웹 서버 응답 시, 포트 번호를 이용해 원래 장치로 트래픽 전달**

​	•	209.165.200.226:1444 → 192.168.10.11:1444

​	•	209.165.200.226:1445 → 192.168.10.12:1444

​	•	**NAT 라우터는 원래 출발지 포트 정보를 기억하고 있어 올바른 내부 장치로 응답을 전달**

**3️⃣ PAT이 필요한 이유**



✅ **공인 IP를 절약하면서 동시에 여러 장치가 인터넷 사용 가능**

✅ **동일한 포트를 사용해도 충돌 없이 NAT 변환 가능**

✅ **포트가 부족하면 새로운 공인 IP를 할당하여 계속 동작 가능**

**4️⃣ 결론**



✅ **PAT는 원래 포트를 유지하려 하지만, 사용 중이면 다음 사용 가능한 포트를 할당**

✅ **이 덕분에 여러 장치가 동일한 공인 IP를 공유하면서도 트래픽을 구별할 수 있음**

✅ **패킷이 돌아올 때 원래 포트 정보로 변환하여 올바른 장치로 전달됨**



🚀 **즉, “Next Available Port”는 PAT가 포트 충돌을 방지하고 여러 장치가 하나의 공인 IP를 사용할 수 있도록 하는 핵심 기술!** 

🚀



------

## 6.2.5 NAT and PAT Comparison



------

## 6.3.1 Advantages of NAT

사술을 공인 

주소를 감출 수 있음



단점

정책을 적용했을때 그 IP 가 변경이 됐을때 보안이 적용 되지 않는다.



------

## 6.4.2 Configure Static NAT

![image-20250210170105201](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210170105201.png)

**📌 Static NAT 설정 (쉽게 정리)**



✅ **Static NAT(정적 NAT)란?**

​	•	**내부 사설 IP(Inside Local)를 외부 공인 IP(Inside Global)로 1:1 매핑**

​	•	**고정된 IP 주소를 유지해야 하는 서버나 장치에 사용**

**1️⃣ Static NAT 설정 과정 (2단계)**



💡 **예제:**

​	•	**내부 사설 IP:** 192.168.10.254

​	•	**외부 공인 IP:** 209.165.201.5



**🔹 Step 1: IP 주소 매핑 설정**

```
R2(config)# ip nat inside source static 192.168.10.254 209.165.201.5
```

✅ **내부 IP(192.168.10.254)를 공인 IP(209.165.201.5)로 변환하도록 설정**

✅ **이제 외부에서 209.165.201.5로 접근하면 내부 서버(192.168.10.254)로 연결됨**

**🔹 Step 2: NAT 인터페이스 지정**

​	•	**NAT에서 내부 네트워크와 외부 네트워크를 구분해야 함**

​	•	**Serial 0/1/0 = 내부(Inside)**

​	•	**Serial 0/1/1 = 외부(Outside)**

```
R2(config)# interface serial 0/1/0
R2(config-if)# ip address 192.168.1.2 255.255.255.252
R2(config-if)# ip nat inside
R2(config-if)# exit
```

✅ **Serial 0/1/0을 내부 인터페이스로 설정**

```
R2(config)# interface serial 0/1/1
R2(config-if)# ip address 209.165.200.1 255.255.255.252
R2(config-if)# ip nat outside
```

✅ **Serial 0/1/1을 외부 인터페이스로 설정**

**2️⃣ NAT 동작 방식**



**📌 1. 내부 네트워크에서 인터넷으로 나갈 때**

​	•	**PC(192.168.10.254) → R2(209.165.201.5) → 인터넷**

​	•	R2는 **192.168.10.254를 209.165.201.5로 변환**하여 외부 네트워크로 전달



**📌 2. 외부에서 내부 서버로 접속할 때**

​	•	**인터넷 사용자(209.165.201.5로 접속) → R2 → 내부 서버(192.168.10.254)**

​	•	R2는 **공인 IP(209.165.201.5)를 내부 IP(192.168.10.254)로 변환**하여 전달

**3️⃣ Static NAT의 특징**



✅ **공인 IP를 항상 고정된 내부 IP와 연결 → 서버 접근이 용이함**

✅ **변경되지 않는 1:1 매핑 → 예측 가능한 네트워크 트래픽**

✅ **보안성 낮음 (공인 IP가 항상 노출됨)**



🚀 **즉, Static NAT은 웹 서버, 원격 접속 서버 등에 사용되며, 내부 서버가 고정된 공인 IP를 통해 외부에서 접근 가능하도록 함!** 🚀



------

## 6.4.4 Verify Static NAT

### 변경 확인 명령어

ip sh ro

```bash
R2# show ip nat translations
Pro  Inside global       Inside local       Outside local     Outside global
---  209.165.201.5       192.168.10.254     ---               ---
Total number of translations: 1
```







------

# 6.5 Dynamic NAT



## 6.5.2 Configure Dynamic NAT

![image-20250210170557018](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210170557018.png)

pool 을 먼저 만들어야 함

공인

```
R2(config)# ip nat pool NAT-POOL1 209.165.200.226 209.165.200.240 netmask 255.255.255.224
```



```
R2(config)# access-list 1 permit 192.168.0.0 0.0.255.255
```



```bash
R2(config)# ip nat inside source list 1 pool NAT-POOL1
```



```bash
R2(config)# interface serial 0/1/0
R2(config-if)# ip nat inside
```



```bash
R2(config)# interface serial 0/1/1
R2(config-if)# ip nat outside
```





------

## 6.5.5 Verify Dynamic NAT

확인하는 법

```bash
R2# show ip nat translations
Pro Inside global      Inside local       Outside local      Outside global
--- 209.165.200.228    192.168.10.10      ---                ---
--- 209.165.200.229    192.168.11.10      ---                ---
R2#
```



```bash
R2# show ip nat translation verbose
Pro Inside global      Inside local       Outside local      Outside global
tcp 209.165.200.228    192.168.10.10      ---                ---
    create 00:02:11, use 00:02:11 timeout:86400000, left 23:57:48, Map-Id(In): 1,
    flags:
none, use_count: 0, entry-id: 10, lc_entries: 0
tcp 209.165.200.229    192.168.11.10      ---                ---
    create 00:02:10, use 00:02:10 timeout:86400000, left 23:57:49, Map-Id(In): 1,
    flags:
none, use_count: 0, entry-id: 12, lc_entries: 0
R2#
```





------

## 6.6.1 PAT Scenario

![image-20250210171125839](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210171125839.png)

```bash
R2(config)# ip nat inside source list 1 interface serial 0/1/1 overload
```

**📌 PAT (Port Address Translation)란?**



✅ **PAT(포트 주소 변환, NAT Overload)란?**

​	•	**하나의 공인 IP를 여러 사설 IP가 공유하여 인터넷을 사용할 수 있도록 하는 기술**

​	•	**각 장치는 포트 번호를 활용하여 구분됨**

​	•	**홈 네트워크, 기업 네트워크에서 가장 일반적으로 사용됨**

**1️⃣ PAT 동작 방식 (기본 개념)**

​	•	내부 네트워크에 있는 여러 장치(PC, 서버 등)가 **하나의 공인 IP를 공유**

​	•	**각 세션을 고유한 포트 번호로 구별하여 트래픽을 관리**

​	•	**예제:**

| **출발지 (Inside Local IP:Port)** | **변환 후 (Inside Global IP:Port)** | **목적지 (Outside Global IP:Port)** |
| --------------------------------- | ----------------------------------- | ----------------------------------- |
| 192.168.10.10:1444                | 209.165.200.225:1444                | 209.165.201.1:80                    |
| 192.168.11.10:1444                | 209.165.200.225:1445                | 209.165.202.129:80                  |





✅ **PC1과 PC2가 같은 포트(1444)를 사용했지만, 라우터가 변환하여 충돌을 방지**

✅ **외부에서는 209.165.200.225:1444, 209.165.200.225:1445와 같이 각 트래픽을 구별 가능**

**2️⃣ PAT 구성 방법 (공인 IP 1개 사용)**



💡 **PAT을 설정하려면 overload 옵션을 추가해야 함**



**📌 설정 예제 (R2 라우터)**

```
R2(config)# ip nat inside source list 1 interface serial 0/1/1 overload
```

✅ **ACL 1에 해당하는 모든 내부 IP를 공인 IP(209.165.200.225)로 변환**

✅ **라우터의 Serial 0/1/1 인터페이스 IP를 공인 IP로 사용**

✅ **각 세션을 포트 번호를 사용해 구별 (Overload 옵션 사용)**

```
R2(config)# access-list 1 permit 192.168.0.0 0.0.255.255
```

✅ **ACL 1을 생성하여 192.168.0.0/16 대역을 NAT 대상으로 지정**

```
R2(config)# interface serial 0/1/0
R2(config-if)# ip nat inside
R2(config-if)# exit
```

✅ **Serial 0/1/0을 내부 네트워크(Inside)로 설정**

```
R2(config)# interface serial 0/1/1
R2(config-if)# ip nat outside
```

✅ **Serial 0/1/1을 외부 네트워크(Outside)로 설정**

**3️⃣ PAT의 장점과 단점**



✅ **장점**

​	•	**공인 IP 절약 가능** (여러 장치가 하나의 공인 IP 공유)

​	•	**트래픽 관리 가능** (각 장치를 포트 번호로 구별)

​	•	**보안 강화** (공인 IP 하나만 노출, 내부 IP 숨김)



❌ **단점**

​	•	**트래픽이 많아지면 포트 부족 문제 발생 가능**

​	•	**같은 공인 IP를 공유하므로 특정 장치로 포트 포워딩 필요할 수 있음**

**4️⃣ 결론**



✅ **PAT은 하나의 공인 IP를 여러 장치가 공유할 수 있도록 해주는 가장 일반적인 NAT 방식**

✅ **포트 번호를 활용하여 각 트래픽을 구별하고, NAT 테이블에 기록하여 관리**

✅ **설정 시 overload 옵션을 추가하여 공인 IP 하나로 여러 세션을 처리하도록 구성**



🚀 **즉, 우리가 집에서 여러 기기가 하나의 공인 IP로 인터넷을 사용하는 것은 바로 PAT 덕분!** 🚀



------

## 6.6.4 Analyze PAT - PC to Server

![image-20250210171303863](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210171303863.png)



------

# 6.7 NAT64

헤더를 바꾸는 것

![image-20250210171450515](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/image-20250210171450515.png)

**📌 IPv6에서 NAT(NAT64) 쉽게 정리**



✅ **IPv6에서 NAT의 역할**

​	•	**IPv6에서는 IPv4처럼 사설 IP를 공인 IP로 변환하는 용도로 사용되지 않음**

​	•	**IPv6 전용 네트워크와 IPv4 전용 네트워크 간의 통신을 가능하게 하는 역할**

**1️⃣ NAT64란?**

​	•	**IPv6-Only 네트워크가 IPv4 인터넷과 통신할 수 있도록 변환하는 기술**

​	•	**IPv6 패킷을 IPv4 패킷으로 변환하고, 다시 IPv4에서 IPv6으로 변환**

​	•	**공유기(Router)에서 수행되며, IPv4 주소 부족 문제를 해결하는 데 도움을 줌**



🔹 **즉, NAT64는 IPv6 전용 장치가 IPv4 웹사이트 및 서버에 접근할 수 있도록 도와주는 기술!**

**2️⃣ IPv6 전환을 위한 주요 기술 3가지**



1️⃣ **Dual-Stack (듀얼 스택)**

​	•	**하나의 장치에서 IPv4와 IPv6를 동시에 사용 가능**

​	•	**서버와 네트워크 장비가 두 프로토콜을 지원해야 함**



2️⃣ **Tunneling (터널링)**

​	•	**IPv6 패킷을 IPv4 패킷 내부에 캡슐화하여 IPv4 네트워크를 통해 전송**

​	•	**IPv6 지원이 부족한 네트워크에서 임시 해결책으로 사용**



3️⃣ **Translation (주소 변환, NAT64)**

​	•	**IPv6 장치가 IPv4 장치와 통신할 수 있도록 주소 및 패킷 변환 수행**

​	•	**IETF는 기존의 NAT-PT 방식을 폐기하고 NAT64를 권장**

**3️⃣ NAT64 동작 방식**



💡 **IPv6-Only 장치 → IPv4 인터넷에 접속할 때의 과정**

​	1.	**IPv6 패킷이 NAT64 라우터로 전송됨**

​	2.	**NAT64 라우터가 IPv6 패킷을 IPv4 패킷으로 변환**

​	3.	**IPv4 인터넷을 통해 목적지(IPv4 서버)로 전송**

​	4.	**IPv4 서버의 응답이 NAT64 라우터로 돌아옴**

​	5.	**NAT64 라우터가 IPv4 패킷을 다시 IPv6 패킷으로 변환**

​	6.	**IPv6-Only 장치로 응답 전달**



✅ **즉, NAT64는 IPv6 네트워크가 기존 IPv4 인터넷과 통신할 수 있도록 해줌!**

**4️⃣ NAT64는 장기적인 해결책이 아님**



❌ **IPv6로의 완전한 전환을 목표로 한 임시 해결책**

❌ **모든 네트워크가 IPv6로 전환되면 더 이상 필요하지 않음**

✅ **장기적으로는 NAT64 대신 “완전한 IPv6 네트워크” 구축이 목표**

**5️⃣ 결론**



✅ **NAT64는 IPv6-Only 네트워크가 IPv4 인터넷과 통신할 수 있도록 하는 변환 기술**

✅ **IPv6 전환 과정에서 임시로 사용되며, 장기적으로는 IPv6 네이티브 환경이 필요**

✅ **IPv6 전환을 위해 Dual-Stack, Tunneling, NAT64 같은 다양한 방법이 존재**



🚀 **즉, NAT64는 IPv6-Only 환경에서도 기존의 IPv4 서버와 인터넷을 이용할 수 있도록 해주는 “IPv6-IPv4 연결 다리 역할”을 하는 기술!** 🚀
