---
title: <h0>1/23 cisco virtal cloud</h0>
author: cotes   
categories: [cisco virtual cloud]
tags: [Network]


---

## CCNA: Switching, Routing, and Wireless Essentials

# 1.1 Configure a Switch with Initial Settings

------

1.1.1 Switch Boot Sequence

switch, router memory 종류

- RAM (휘발성)
- NVRAM (비 휘발성)
- ROM (포스트 프로그램) - 부트 할때 로드 및 이미지 실행
- FLASH (IOS 이미지) - 이미지 자체 문제가 생겨서 실행되지 않는게 태반

**Step 1**: 스위치는 ROM에 저장된 전원 켜기 자체 테스트(POST) 프로그램을 로드합니다. POST는 CPU 하위 시스템을 검사하며, CPU, DRAM 및 플래시 파일 시스템을 구성하는 플래시 장치의 일부를 테스트

Step 2: 스위치는 부트 로더 소프트웨어를 로드합니다. 부트 로더는 ROM에 저장된 작은 프로그램으로, POST가 성공적으로 완료된 후 즉시 실행

**3단계:**

부트 로더는 저수준의 CPU 초기화를 수행합니다. 여기에는 물리적 메모리의 매핑 위치, 메모리 용량, 속도를 제어하는 CPU 레지스터 초기화가 포함됩니다.

**4단계:**

부트 로더는 시스템 보드의 플래시 파일 시스템을 초기화합니다.

**5단계:**

마지막으로, 부트 로더는 기본 IOS 운영 체제 소프트웨어 이미지를 메모리에 로드하고 스위치의 제어를 IOS로 넘깁니다.

------

## 1.1.2 The boot system Command

```
S1(config)# ***\*boot system flash:/c2960-lanbasek9-mz.150-2.SE/c2960-lanbasek9-mz.150-2.SE.bin\****
```

------

## 1.1.4 Recovering from a System Crash

기본적으로 스위치는 boot 환경 변수의 정보를 사용하여 자동으로 부팅 시도하지만, 스위치 boot 환경 변수의 경로를 보려면 set 명령을 입력한다. 그런 다음 flesh_init 명령을 사용하여 플래시 파일 시스템을 초기화하여 출력에 표시된 대로 플래시의 현재 파일을 본다.

ROM 의 영향을 받는다.

```
switch: set
BOOT=flash:/c2960-lanbasek9-mz.122-55.SE7/c2960-lanbasek9-mz.122-55.SE7.bin
(output omitted)
switch: flash_init
Initializing Flash...
flashfs[0]: 2 files, 1 directories
flashfs[0]: 0 orphaned files, 0 orphaned directories
flashfs[0]: Total bytes: 32514048
flashfs[0]: Bytes used: 11838464
flashfs[0]: Bytes available: 20675584
flashfs[0]: flashfs fsck took 10 seconds.
...done Initializing Flash.
```

```
switch: dir flash:
Directory of flash:/
    2  -rwx  11834846  <date>               c2960-lanbasek9-mz.150-2.SE8.bin
    3  -rwx  2072      <date>               multiple-fs
```

플래시 초기화가 되고, **dir flash:** 명령을 입력하면 출력에 표시된 대로 플래시 내의 디렉토리와 파일을 볼 수 있다.

```
switch: BOOT=flash:c2960-lanbasek9-mz.150-2.SE8.bin
switch: set
BOOT=flash:c2960-lanbasek9-mz.150-2.SE8.bin
(output omitted)
switch: boot
```

**BOOT=flash** 명령을 입력하여 스위치가 플래시에서 새 IOS를 로드하는 데 사용하는 BOOT 환경 변수 경로를 변경한다. 새 BOOT 환경 변수 경로를 확인하려면 **set 명령을 다시 실행** 하고,  **마지막으로 출력에 표시된 대로 인수 없이** **boot** 명령을 입력하여 새 IOS를 로드한다.

------

## 1.1.5 Switch Management Access

OOB 연결(out of band)

- console 연결

In- Band 연결

telnet , ssh - 실제 데이터가 흐르는 인터페이스를 통해 데이터를 전달한다. 

![스크린샷 2025-01-23 오전 10.12.31](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/스크린샷 2025-01-23 오전 10.12.31.png)

------

## 1.1.6 Switch SVI(Switch virual interface) Configuration Example

스위치는 VLAN 1을 통해 관리를 제어하도록 구성하고, 모든 포트는 기본적으로 VLAN 1에 할당되는데 보안상의 이유로 관리 VLAN에 VLAN 1이 아닌 다른 VLAN(예: VLAN 99)을 사용하는 것이 일반적이다.

**1. VLAN(Virtual Local Area Network)이란?**

(12비트) VLAN은 네트워크를 논리적으로 분할하여 같은 물리적 네트워크에 있어도 서로 다른 브로드캐스트 도메인을 만들 수 있도록 해준다. 즉, VLAN을 사용하면 네트워크 장치를 그룹화하여 서로 다른 네트워크처럼 동작하도록 설정할 수 있다.

​	•	VLAN을 사용하면 브로드캐스트 트래픽이 VLAN 내부에서만 전달된다.

​	•	서로 다른 VLAN 간에는 기본적으로 통신할 수 없으며, 라우터 또는 L3 스위치가 필요하다.

**2. 플러딩(Flooding)이란?**

플러딩은 스위치가 목적지를 모르는 프레임(예: ARP 요청, 브로드캐스트 프레임 등)을 모든 포트로 전달하는 동작을 의미한다.

​	•	스위치가 특정 MAC 주소를 테이블에서 찾지 못하면, 네트워크의 모든 포트(수신 포트 제외)로 프레임을 전송하여 목적지를 찾으려고 한다.

​	•	브로드캐스트(예: ARP 요청)는 기본적으로 네트워크 전체에 플러딩된다.

​	•	플러딩을 줄이려면 네트워크 설계를 최적화하고 VLAN을 적절히 구성해야 한다.

------

**3. VLAN과 플러딩의 관계**

VLAN이 설정되면 플러딩의 범위가 VLAN 단위로 제한된다.

​	•	VLAN을 사용하면 스위치에서 플러딩이 발생할 때, 해당 VLAN 내부의 포트로만 프레임이 전달된다.

​	•	예를 들어, VLAN 10에 있는 장치가 브로드캐스트 패킷을 보내면 VLAN 10에 속한 포트로만 전달되고, VLAN 20의 장치에는 영향을 미치지 않는다.

​	•	VLAN을 적절히 구성하면 불필요한 플러딩을 방지하여 네트워크 성능을 개선할 수 있다.

------

**4. 예제 시나리오**

예를 들어, 스위치에 다음과 같은 VLAN이 구성되어 있다고 가정한다.

​	•	VLAN 10: 192.168.1.0/24 (PC1, PC2)

​	•	VLAN 20: 192.168.2.0/24 (PC3, PC4)

PC1이 PC2의 MAC 주소를 모르면 ARP 요청을 보내게 된다. 이때 플러딩이 발생하지만, VLAN 10의 포트로만 브로드캐스트가 발생하며 VLAN 20의 PC3와 PC4는 영향을 받지 않는다.

![image-20250123102114797](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123102114797.png)

원격 접속 설정

1. SVI 설정
2. gateway 설정
3. telnet, ssh 설정 (line vty ...)

예제2 vlan 100에 ip 1.1.1.1/24 를 설정

```
Switch(config)#int vlan 100
Switch(config-if)#ip add 1.1.1.1 255.255.255.0
```

**Configure the Default Gateway**

```
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#ip default-gateway 172.17.99.1
Switch(config)#end
%SYS-5-CONFIG_I: Configured from console by console

Switch#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
```

# 1.2 Configure Switch Ports

------

1.2.2 Configure Switch Ports at the Physical Layer

![image-20250123104803696](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123104803696.png)

```
en
conf t
int f0/1
duplex full
speed 100
```

![image-20250123105212420](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123105212420.png)

주의할점으로 듀플렉스 모드와 스위치 포트 속도에 대한 설정이 일치하지 않으면 연결 문제가 발생할 수 있습니다. 

------

## 1.2.3 Auto-MDIX

자동 MDIX가 활성화되면 두 가지 유형의 케이블을 사용하여 다른 장치에 연결할 수 있으며 인터페이스는 자동으로 조정되어 성공적으로 통신합니다. 최신 Cisco 스위치에서는 **mdix 자동 인터페이스 구성 모드 명령으로 이 기능을 활성화합니다. 인터페이스에서 자동 MDIX를 사용하는 경우 인터페이스 속도와 듀플렉스를** **자동** 으로 설정해야 기능이 올바르게 작동합니다.

```
S1(config-if)# mdix auto
```

**참고:** 자동 MDIX 기능은 Catalyst 2960 및 Catalyst 3560 스위치에서는 기본적으로 활성화되어 있지만 기존 Catalyst 2950 및 Catalyst 3550 스위치에서는 사용할 수 없습니다.

```
S1# show controllers ethernet-controller fa0/1 phy | include MDIX
Auto-MDIX           :  On   [AdminState=1   Flags=0x00052248]
```

------

## 1.2.4 Switch Verification Commands



```bash
show interfaces # 인터페이스 상태와 구성을 표시
show startup-config # 현재 시작 구성을 표시한다.
show running-config램에 있는 정보를 본다. # 현재 실행 중인 구성을 표시합니다.
show flash # 플래시 파일 시프템에 대한 정보 표시
show version	# 몇 버전으로 부팅 중인지 확인
show ip interface # 인터페이스 정보 표시
show ipv6 interface
show mac-address-table
show mac address-table
```

```bash
show history # 지금까지 쳤던 명령어 
```

```
sh int f0/1
sh ip int vlan 1 (layer 3)
```



------

## 1.2.5 Verify Switch Port Configuration



#### **show running-config** 

- Fast Ethernet 0/18 인터페이스는 관리 VLAN 99로 구성됩니다.
- VLAN 99는 172.17.99.11 255.255.255.0의 IPv4 주소로 구성됩니다.
- 기본 게이트웨이는 172.17.99.1로 설정되어 있습니다.

```
S1# show running-config
Building configuration...
Current configuration : 1466 bytes
!
interface FastEthernet0/18
switchport access vlan 99
switchport mode access
!
(output omitted)
!
interface Vlan99
ip address 172.17.99.11 255.255.255.0
ipv6 address 2001:DB8:ACAD:99::1/64
!
ip default-gateway 172.17.99.1

```

```
S1# show interfaces fastEthernet 0/18
FastEthernet0/18 is up, line protocol is up (connected)
  Hardware is Fast Ethernet, address is 0025.83e6.9092 (bia 0025.83e6.9092)
  MTU 1500 bytes, BW 100000 Kbit/sec, DLY 100 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Full-duplex, 100Mb/s, media type is 10/100BaseTX
```

**show interfaces fastEthernet 0/18** 명령 의 출력의 첫 번째 줄은 FastEthernet 0/18 인터페이스가 up/up 상태이며, 즉 작동 중임을 나타냅니다. 더 아래로 출력은 듀플렉스가 full이고 속도가 100Mbps임을 보여줍니다.

#### **load interval 설정**

```
en
conf t
int f0/1
load-interval 30
```



input = inbound = ingress

output = outbound = egress

------

## 1.2.6 Network Access Layer Issues



클라이언트가 문제가 있으면 요청하여 관리자가 확인한다.

```
S1# show interfaces fastEthernet 0/18
....
5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     2295197 packets input, 305539992 bytes, 0 no buffer
     Received 1925500 broadcasts (74 multicasts)
     0 runts, 0 giants, 0 throttles
     3 input errors, 3 CRC, 0 frame, 0 overrun, 0 ignored
     0 watchdog, 74 multicast, 0 pause input
     0 input packets with dribble condition detected
     3594664 packets output, 436549843 bytes, 0 underruns
     8 output errors, 0 collisions, 10 interface resets
     0 unknown protocol drops
     0 babbles, 235 late collision, 0 deferred

```

|          오류 유형          |                           **설명**                           |
| :-------------------------: | :----------------------------------------------------------: |
|  입력 오류 (Input Errors)   | 총 오류 수로, 런트, 자이언트, 버퍼 부족, CRC, 프레임, 오버런, 무시된 카운트를 포함함. |
|        런트 (Runts)         | 프레임 크기가 최소 프레임 크기보다 작아 폐기된 프레임. 예: 64바이트 미만의 이더넷 프레임. |
|      자이언트 (Giants)      | 프레임 크기가 최대 프레임 크기를 초과하여 폐기된 프레임. 예: 1,518바이트 초과 이더넷 프레임. |
|             CRC             | 수신된 체크섬과 계산된 체크섬이 일치하지 않을 때 발생하는 오류. |
|  출력 오류 (Output Errors)  |   인터페이스에서 데이터그램 전송을 방해한 모든 오류의 합.    |
|      충돌 (Collisions)      | 이더넷 충돌로 인해 재전송된 메시지 수. (하프 듀플렉스 환경에서 많이 일어남) |
| 지연 충돌 (Late Collisions) |        프레임의 512비트 이상이 전송된 후 발생한 충돌.        |
|                             |                                                              |

------

## 1.2.8 Troubleshooting Network Access Layer Issues

이론적으로 네트워크는 설치된 후 문제 없이 계속 작동하는데, 그러나 케이블이 손상되고 구성이 변경되며 스위치 구성 변경이 필요한 새 장치가 스위치에 연결된다.

![image-20250123111715428](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123111715428.png)

------

# 1.3 Secure Remote Access

------

## 1.3.3 Verify the Switch Supports SSH

Catalyst 2960 스위치에서 SSH를 활성화하려면 스위치가 암호화된 기능 및 성능을 포함하는 IOS 소프트웨어 버전을 사용해야 한다.

스위치에서 **show version** 명령을 사용하여 스위치가 현재 실행 중인 IOS를 확인한다. "k9" 조합을 포함하는 IOS 파일 이름은 암호화된 기능 및 성능을 지원한다.

```
S1# show version
Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 15.0(2)SE7, RELEASE SOFTWARE (fc1)
```

------

## 1.3.4 Configure SSH

SSH를 구성하기 전에 최소한 스위치를 고유한 호스트 이름과 올바른 네트워크 연결 설정으로 구성해야 합니다.

**Step 1**

**Verify SSH support.**

```
S1# show ip ssh
```

**Step 2**

**Configure the IP domain.**

```
S1(config)# ip domain-name cisco.com
```

**Step 3**

**Generate RSA key pairs.**

```
S1(config)# crypto key generate rsa
How many bits in the modulus [512]: 1024
```

**Step 4**

**Configure user authentication.**

```
S1(config)# username admin secret ccna
```

**Step 5**

**Configure the vty lines.**

```
S1(config)# line vty 0 15 # 16개의 세션을 열음
S1(config-line)# transport input ssh	## ssh의 포트만 열음
S1(config-line)# login local
S1(config-line)# exit
```

**6단계**

**SSH 버전 2를 활성화합니다.**

```
S1(config)# ip ssh version 2
```

------

## 1.3.5 Verify SSH is Operational

```
Login as: admin
Using keyboard-interactive
Authentication.
Password:
S1> enable
Password:
S1#
```

```
S1# show ip ssh
SSH Enabled - version 2.0
Authentication timeout: 120 secs; Authentication retries: 3
To check the SSH connections to the device, use the show ssh command as shown.
S1# show ssh
%No SSHv1 server connections running.
Connection Version Mode Encryption  Hmac                State          Username
0          2.0     IN   aes256-cbc  hmac-sha1    Session started       admin
0          2.0     OUT  aes256-cbc  hmac-sha1    Session started       admin
S1#
```

------

## 1.4.1 Configure Basic Router Settings

```
Router# configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)# hostname R1
R1(config)# enable secret class
R1(config)# line console 0
R1(config-line)# password cisco
R1(config-line)# login
R1(config-line)# exit
R1(config)# line vty 0 4
R1(config-line)# password cisco
R1(config-line)# login
R1(config-line)# exit
R1(config)# service password-encryption
R1(config)#
```

------

## 1.4.3 Dual Stack Topology

![image-20250123114347040](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123114347040.png)

------

## 1.4.4 Configure Router Interfaces

듀얼 스택

```
R1(config-if)# ip address 192.168.10.1 255.255.255.0
R1(config-if)# ipv6 address 2001:db8:acad:1::1/64
```



```
R1(config)# interface gigabitethernet 0/0/0
R1(config-if)# ip address 192.168.10.1 255.255.255.0
R1(config-if)# ipv6 address 2001:db8:acad:1::1/64
R1(config-if)# description Link to LAN 1
R1(config-if)# no shutdown
R1(config-if)# exit
R1(config)# interface gigabitethernet 0/0/1
R1(config-if)# ip address 192.168.11.1 255.255.255.0
R1(config-if)# ipv6 address 2001:db8:acad:2::1/64
R1(config-if)# description Link to LAN 2
R1(config-if)# no shutdown
R1(config-if)# exit
R1(config)# interface serial 0/0/0
R1(config-if)# ip address 209.165.200.225 255.255.255.252
R1(config-if)# ipv6 address 2001:db8:acad:3::225/64
R1(config-if)# description Link to R2
R1(config-if)# no shutdown
R1(config-if)# exit
R1(config)#
```

------

## 1.4.6 IPv4 Loopback Interfaces

루프백 인터페이스는 라우터 내부의 논리적 인터페이스로 물리적 포트에 할당하지 않으며, 다른 장치에 연결할 수 없다.

라우터가 작동하는 한 자동으로 up 상태를 유지한다.

루프백 인터페이스는 cisco ios 장치를 테스트 하고 관리하는데 유용하다.

예를 들어 내부 라우팅 유형으로 프로세스를 테스트할 수 있다.

```
Router(config)# interface loopback number 
```

```
Router(config-if)# ip address ip-address subnet-mask 
```

```
R1(config)# interface loopback 0
R1(config-if)# ip address 10.0.0.1 255.255.255.0
R1(config-if)# exit
R1(config)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
```

라우터 식별자(ID)

1. 물리 인터페이스 IP (가장 큰 값) - 식별자가 활성화된
2. loopback 이 설정 되면 이게 우선시 된다. (큰 값일수록 우선시 된다.)

------

## 1.5.2 Verify Interface Status

```
R1# show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0/0   192.168.10.1    YES manual up                    up
GigabitEthernet0/0/1   192.168.11.1    YES manual up                    up
Serial0/1/0            209.165.200.225 YES manual up                    up
Serial0/1/1            unassigned      YES unset  administratively down down
R1# show ipv6 interface brief
GigabitEthernet0/0/0   [up/up]
    FE80::7279:B3FF:FE92:3130
    2001:DB8:ACAD:1::1
GigabitEthernet0/0/1   [up/up]
    FE80::7279:B3FF:FE92:3131
    2001:DB8:ACAD:2::1
Serial0/1/0            [up/up]
    FE80::7279:B3FF:FE92:3130
    2001:DB8:ACAD:3::1
Serial0/1/1            [down/down]     Unassigned
```

------

## 1.5.3 Verify IPv6 Link Local and Multicast Addresses

```
R1# show ipv6 interface gigabitethernet 0/0/0
GigabitEthernet0/0/0 is up, line protocol is up
  IPv6 is enabled, link-local address is FE80::7279:B3FF:FE92:3130
  No Virtual link-local address(es):
  Global unicast address(es):
    2001:DB8:ACAD:1::1, subnet is 2001:DB8:ACAD:1::/64
  Joined group address(es):
    FF02::1		# 멀티 캐스트
    FF02::1:FF00:1
    FF02::1:FF92:3130
  MTU is 1500 bytes
  ICMP error messages limited to one every 100 milliseconds
  ICMP redirects are enabled
  ICMP unreachables are sent
  ND DAD is enabled, number of DAD attempts: 1
  ND reachable time is 30000 milliseconds (using 30000)
  ND advertised reachable time is 0 (unspecified)
  ND advertised retransmit interval is 0 (unspecified)
  ND router advertisements are sent every 200 seconds
  ND router advertisements live for 1800 seconds
  ND advertised default router preference is Medium
```

------

## 1.5.4 Verify Interface Configuration

**show running-config interface** 명령 의 출력에는 지정된 인터페이스에 적용된 현재 명령이 다음과 같이 표시됩니다.

```
R1 show running-config interface gigabitethernet 0/0/0
Building configuration...
Current configuration : 158 bytes
!
interface GigabitEthernet0/0/0
    description Link to LAN 1
    ip address 192.168.10.1 255.255.255.0
    negotiation auto
    ipv6 address 2001:DB8:ACAD:1::1/64
end
R1#

```

1.5.5 Verify Routes

```
R1# show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
      
Gateway of last resort is not set
      192.168.10.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.10.0/24 is directly connected, GigabitEthernet0/0/0
L        192.168.10.1/32 is directly connected, GigabitEthernet0/0/0
      192.168.11.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.11.0/24 is directly connected, GigabitEthernet0/0/1
L        192.168.11.1/32 is directly connected, GigabitEthernet0/0/1
      209.165.200.0/24 is variably subnetted, 2 subnets, 2 masks
C        209.165.200.224/30 is directly connected, Serial0/1/0
L        209.165.200.225/32 is directly connected, Serial0/1/0
R1# show ipv6 route
IPv6 Routing Table - default - 7 entries
Codes: C - Connected, L - Local, S - Static, U - Per-user Static route
      
C   2001:DB8:ACAD:1::/64 [0/0]
     via GigabitEthernet0/0/0, directly connected
L   2001:DB8:ACAD:1::1/128 [0/0]		// 실제 ip 주소
     via GigabitEthernet0/0/0, receive
C   2001:DB8:ACAD:2::/64 [0/0]
     via GigabitEthernet0/0/1, directly connected
L   2001:DB8:ACAD:2::1/128 [0/0]
     via GigabitEthernet0/0/1, receive
C   2001:DB8:ACAD:3::/64 [0/0]
     via Serial0/1/0, directly connected
L   2001:DB8:ACAD:3::1/128 [0/0]
     via Serial0/1/0, receive
L   FF00::/8 [0/0]
     via Null0, receive
R1#
```

------

## 1.5.6 Filter Show Command Output

**section**

예시에 표시된 대로, 필터링 표현식으로 시작하는 전체 섹션을 표시합니다.

```
R1# show running-config | section line vty
line vty 0 4
 password 7 110A1016141D
 login
 transport input all
```

**include**

Includes all output lines that match the filtering expression, as shown in the example.

```
R1# show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0/0   192.168.10.1    YES manual up                    up
GigabitEthernet0/0/1   192.168.11.1    YES manual up                    up
Serial0/1/0            209.165.200.225 YES manual up                    up
Serial0/1/1            unassigned      NO  unset  down                  down
R1#
R1# show ip interface brief | include up
GigabitEthernet0/0/0   192.168.10.1    YES manual up                    up
GigabitEthernet0/0/1   192.168.11.1    YES manual up                    up
Serial0/1/0            209.165.200.225 YES manual up                    up
```

**exclude**

Excludes all output lines that match the filtering expression, as shown in the example.

```
R1# show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0/0   192.168.10.1    YES manual up                    up
GigabitEthernet0/0/1   192.168.11.1    YES manual up                    up
Serial0/1/0            209.165.200.225 YES manual up                    up
Serial0/1/1            unassigned      NO  unset  down                  down
R1#
R1# show ip interface brief | exclude unassigned
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0/0   192.168.10.1    YES manual up                    up
GigabitEthernet0/0/1   192.168.11.1    YES manual up                    up
Serial0/1/0            209.165.200.225 YES manual up                    up
```


예제에서 보듯이, 필터링 표현식과 일치하는 줄부터 시작하여 특정 지점부터 모든 출력 줄을 표시합니다.

```
R1# show ip route | begin Gateway
Gateway of last resort is not set
      192.168.10.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.10.0/24 is directly connected, GigabitEthernet0/0/0
L        192.168.10.1/32 is directly connected, GigabitEthernet0/0/0
      192.168.11.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.11.0/24 is directly connected, GigabitEthernet0/0/1
L        192.168.11.1/32 is directly connected, GigabitEthernet0/0/1
      209.165.200.0/24 is variably subnetted, 2 subnets, 2 masks
C        209.165.200.224/30 is directly connected, Serial0/1/0
L        209.165.200.225/32 is directly connected, Serial0/1/0
```

------

## 1.5.8 Command History Feature

```
R1# terminal history size 200
R1# show history
  show ip int brief
  show interface g0/0/0
  show ip route
  show running-config
  show history
  terminal history size 200
```

------



# Module3: VLANs 



#### VLAN = broadcast domain = logical subnetwork

![image-20250123121802674](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123121802674.png)

VLAN 이 3 이라고 가정하면 브로드캐스트 도메인이 3개가 존재한다.

```
Switch(config)#vlan 2
Switch(config-vlan)#vlan 3
Switch(config-vlan)#vlan 4
Switch(config-vlan)#do show vlan b

Switch(config-if)#switchport access vlan 2 # layer 2 기능을 활성화 한다.
Switch(config-if)#do show vlan

Switch(config-if)#int range f0/4-6
Switch(config-if-range)#switchport access vlan 3

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/2, Fa0/3, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                Gig0/1, Gig0/2
2    VLAN0002                         active    Fa0/1
3    VLAN0003                         active    Fa0/4, Fa0/5, Fa0/6
4    VLAN0004                         active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active  
```

------

## 3.1.2 Benefits of a VLAN Design

![image-20250123124257389](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123124257389.png)

------

## .1.3 Types of VLANs

**Default VLAN**

**항목**							**설명**

모든 포트 기본 VLAN	모든 포트는 기본적으로 VLAN 1에 할당됨.

기본(native) VLAN	기본(native) VLAN은 기본적으로 VLAN 1로 설정됨.

관리 VLAN	관리 VLAN은 기본적으로 VLAN 1로 설정됨.

VLAN 1 제한사항	VLAN 1은 이름을 변경하거나 삭제할 수 없음.

**Data VLAN** - 실제 데이터가 사용되는 vlan

**Native VLAN**

**Voice VLAN**

![image-20250123124623557](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123124623557.png)

원래 vlan 을 2개를 못 갖지만, void vlan을 할 경우 2개가 가능하다.

------

# 3.2 VLANs in a Multi-Switched Environment

## 3.2.1 Defining VLAN Trunks

![image-20250123125212438](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123125212438.png)

trunk 는 스위치와 스위치 사이에만 설정하고 헤더에 태크를 설정한다 4바이트

trunk 하나의 점를 정의해서 연결하는 링크 (프레임에 vlan 태그를 설정)

같은 네트워크에 2개의 pc가 있고 mac 주소 dns source 도 프레임에 포함되어 있더라도 trunk 없이 같은 vlan이 설정 돼 있으면 통신이 불가능하다.

------

## 3.2.4 VLAN Identification with a Tag (태그로 vlan 식별)

![image-20250123130430357](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123130430357.png)

trunk 지점을 지나가면 src mac , type 사이에 tag 프레임이 4바이트로 들어게 된다. (VID 는 vlan number 로 12비트이다.)

- 일반 pc에는 거의 불가능하고 , 서버에는 가능하다.
- tag가 있으면 일반적인 pc에는 버려버린다.

​	•	**Type (유형)** - 2바이트 크기의 값으로 태그 프로토콜 ID(TPID)라고 하며, 이더넷의 경우 16진수 0x8100으로 설정됨.

​	•	**User priority (사용자 우선순위)** - 3비트 값으로, 서비스 수준이나 우선순위 적용을 지원함.

​	•	**Canonical Format Identifier (CFI, 정규 형식 식별자)** - 1비트 식별자로, Token Ring 프레임이 이더넷 링크를 통해 전달될 수 있도록 함.

​	•	**VLAN ID (VID)** - 12비트 VLAN 식별 번호로, 최대 4096개의 VLAN을 지원함.



**VLAN을 사용해야 하는 이유**

​	•	브로드캐스트 도메인을 줄여 성능 최적화.

​	•	네트워크 세분화를 통한 트래픽 분리.

​	•	부서별, 업무별로 논리적 그룹 구성 가능.

​	•	중앙에서 VLAN 정책을 쉽게 관리 및 모니터링 가능.

------

## 3.2.5 Native VLANs and 802.1Q Tagging

ieee 802.1q = dot1q  (하나 인터페이스로 여러 개의 프레임을 구분한다.)

------

## trunk 설정

![image-20250123131419099](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123131419099.png)

```
S2 설정
en
conf
valn 10
valn 20

int f0/11
switchport access vlan 10
int f0/18
sw acc vlan 20

int f0/1
switchport mode trunk
sw trunk native vlan 5 (5번 vlan 으로부터 오는 pc는 프레임이 태그를 붙이지 않는다.)
```

참고: 만약에 위 사진에 vlan 설정이 돼 있지 않는 pc가 2대가 더 있더라면, 그 pc들은 native vlan 으로 가정된다. vlan 의 default 는 1으로

trunk 를 지나갈때 vlan 을 1로 인식하여 vlan이 설정이 안된 pc 끼리 통신이 가능하다.

------

## 3.3.3 VLAN Creation Example

![image-20250123144737811](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123144737811.png)

```
S1# configure terminal
S1(config)# vlan 20
S1(config-vlan)# name student
S1(config-vlan)# end
```

위 명령어들은 스위치 S1에서 **VLAN 20을 생성하고 이름을 “student”로 지정하는 과정** 

​	2.	vlan 20

​	•	VLAN 20을 생성합니다.

​	•	스위치에 새로운 논리적 네트워크(VLAN)를 추가할 수 있도록 설정합니다.

​	3.	name student

​	•	VLAN 20에 이름을 “student”로 지정합니다.

​	•	VLAN의 용도를 명확하게 하기 위해 이름을 지정하는 것이 일반적입니다.

​	4.	end

​	•	설정 모드를 종료하고 프롬프트를 실행 모드로 되돌립니다.

​	•	변경 사항을 적용할 준비가 됩니다.

ㄴ

------

## 3.3.4 VLAN Port Assignment Commands



하나의 vlan 을 갖고 있는 프레임만 통신이 가능하다.

switchport mode

1. dynamic
   - auto
   - desirable
2. access
3. trunk



![image-20250123145801945](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123145801945.png)

------

## 3.3.6 Data and Voice VLANs

```
S3(config)# vlan 20
S3(config-vlan)# name student
S3(config-vlan)# vlan 150
S3(config-vlan)# name VOICE
S3(config-vlan)# exit
S3(config)# interface fa0/18
S3(config-if)# switchport mode access
S3(config-if)# switchport access vlan 20
S3(config-if)# mls qos trust cos # cos 값이 들어왔을때 신뢰 하겠다.
S3(config-if)# switchport voice vlan 150
S3(config-if)# end
S3#
```



------

3.3.8 Verify VLAN Information

```
S1# show interfaces fa0/18 switchport
```

특정 포트의 레이어를 상세 보는 명령어

------

## 3.3.9 Change VLAN Port Membership

```

S1# show interfaces fa0/18 switchport
Name: Fa0/18
Switchport: Enabled
Administrative Mode: static access
Operational Mode: static access
Administrative Trunking Encapsulation: negotiate
Operational Trunking Encapsulation: native
Negotiation of Trunking: Off
Access Mode VLAN: 1 (default)
Trunking Native Mode VLAN: 1 (default)
```



```
Switch#conf
Configuring from terminal, memory, or network [terminal]? 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int f0/1
Switch(config-if)#sw acc vlan 10
% Access VLAN does not exist. Creating vlan 10
Switch(config-if)#
Switch(config-if)#do sh vlan b
```

위의 결과

```
VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/2, Fa0/3, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                Gig0/1, Gig0/2
2    VLAN0002                         active    
3    VLAN0003                         active    Fa0/4, Fa0/5, Fa0/6
4    VLAN0004                         active    
10   VLAN0010                         active    Fa0/1
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
```



------

## 3.3.10 Delete VLANs

```
Switch(config)#no vlan 10
Switch(config)#do show vlan b

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/2, Fa0/3, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                Gig0/1, Gig0/2
2    VLAN0002                         active    
3    VLAN0003                         active    Fa0/4, Fa0/5, Fa0/6
4    VLAN0004                         active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
Switch(config)#
```

------

## 3.4.1 Trunk Configuration Commands

![image-20250123150816753](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123150816753.png)

trunk allowed



------

## 3.4.2 Trunk Configuration Example

![image-20250123150934131](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123150934131.png)

```
S1(config)# interface fastEthernet 0/1
S1(config-if)# switchport mode trunk
S1(config-if)# switchport trunk native vlan 99
S1(config-if)# switchport trunk allowed vlan 10,20,30,99
S1(config-if)# end
```

**참고:** 이 구성은 트렁크 링크에서 802.1Q 캡슐화를 자동으로 사용하는 Cisco Catalyst 2960 스위치를 사용한다고 가정합니다. 다른 스위치는 캡슐화의 수동 구성이 필요할 수 있습니다. 항상 트렁크 링크의 양쪽 끝을 동일한 네이티브 VLAN으로 구성합니다. 양쪽 끝에서 802.1Q 트렁크 구성이 동일하지 않으면 Cisco IOS 소프트웨어에서 오류를 보고



------

## 3.4.3 Verify Trunk Configuration

```
S1# show interfaces fa0/1 switchport
Name: Fa0/1
Switchport: Enabled
Administrative Mode: trunk
Operational Mode: trunk
Administrative Trunking Encapsulation: dot1q
Operational Trunking Encapsulation: dot1q
Negotiation of Trunking: On
Access Mode VLAN: 1 (default)
Trunking Native Mode VLAN: 99 (VLAN0099)
Voice VLAN: none
Administrative private-vlan host-association: none
Administrative private-vlan mapping: none
Administrative private-vlan trunk native VLAN: none
Administrative private-vlan trunk encapsulation: dot1q
Administrative private-vlan trunk normal VLANs: none
Administrative private-vlan trunk associations: none
Administrative private-vlan trunk private VLANs: none
Operational private-vlan: none
Trunking VLANs Enabled: 10,20,30,99
Pruning VLANs Enabled: 2-1001
(output omitted)
```



------

## 3.4.4 Reset the Trunk to the Default State

```
conf
default int 0/1
```



------

# 3.5 Dynamic Trunking Protocol

3.5.2 Negotiated Interface Modes

```
 Switch(config-if)# switchport mode {  access | dynamic {  auto | desirable } |  trunk }
```



```
S1(config-if)# switchport mode trunk
S1(config-if)# switchport nonegotiate
```





![image-20250123151340552](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123151340552.png)

access - 트렁크 모드로 절대 바꿀 수 없음

dynamic auto - 상대편이 트렁크면 나도 트렁크 

dynamic desirable



------

## 3.5.3 Results of a DTP Configuration

![image-20250123151551260](/Users/changhee/2WindowLight.github.io/_posts/images/2025-01-23-cisco/image-20250123151551260.png)



------

## 3.5.4 Verify DTP Mode

```
S1# show dtp interface fa0/1
DTP information for FastEthernet0/1:
TOS/TAS/TNS: ACCESS/AUTO/ACCESS
TOT/TAT/TNT: NATIVE/NEGOTIATE/NATIVE
Neighbor address 1: C80084AEF101
Neighbor address 2: 000000000000
Hello timer expiration (sec/state): 11/RUNNING
Access timer expiration (sec/state): never/STOPPED
Negotiation timer expiration (sec/state): never/STOPPED
Multidrop timer expiration (sec/state): never/STOPPED
FSM state: S2:ACCESS
# times multi & trunk 0
Enabled: yes
In STP: no
```

