---
title: <h0>02/07 OSPF Test</h0>
author: cotes   
categories: [cisco virtual cloud]
tags: [Network]









---

## OSPF TEST

# ![스크린샷 2025-02-07 오전 10.51.27](/Users/changhee/2WindowLight.github.io/_posts/cisco virtual cloud/assets/스크린샷 2025-02-07 오전 10.51.27.png)

------

### R1

```bash
R1#conf t
R1#int lo 0
R1#ip add 1.1.1.1 255.255.255.255
R1#int e0/1
R1#ip add 172.16.145.1 255.255.255.248
R1#no sh

R1#int s2/0
R1#ip add 172.16.12.5 255.255.255.252
R1#no sh
R1#int e0/0
R1#ip add 172.16.13.9 255.255.255.252
R1#no sh
```

### R2

```bash
R2#conf t
R2#ip add 1.1.2.2 255.255.255.255
R2#int lo 2
R2#ip add 192.168.2.2 255.255.255.0
R2#int s2/0
R2#ip add 172.16.12.6 255.255.255.252
R2#no sh
```

### R3

```bash
R3#conf t
R3#ip add 1.1.3.3 255.255.255.255
R3#int lo 3
R3#ip add 192.168.3.3 255.255.255.0
R3#int e0/0
R3#ip add 172.168.13.10 255.255.255.252
R3#no sh
```

### R4

```bash
R4#conf t
R4#int lo 0
R4#ip add 1.1.5.5 255.255.255.255
R4#int e0/0
R4#ip add 172.16.145.5 255.255.255.248
R4#no sh
```

### R5

```bash
R5#conf t
R5#int lo 0
R5#ip add 1.1.5.5 255.255.255.255
R5#int e0/0
R5#ip add 172.16.145.5 255.255.255.248
R5#no sh
```



------

### OSPF 설정

### R1

```bash
R1#conf t
R1#router ospf 1
R1#router-id 1.1.1.1
R1#int e0/1
R1#ip ospf 1 area 0
R1#int lo 0
R1#ip ospf 1 area 0
R1#int s2/0
R1#ip ospf 1 area 1
R1#int e0/0
R1#ip ospf 1 area 2
```

### R2

```bash
R2#conf t
R2#router ospf 2
R2#router-id 1.1.2.2
R2#int lo 0
R2#ip ospf 2 area 1
R2#int lo 2
R2#ip ospf 2 area 1
R2#int s0/0
R2#ip ospf 2 area 1
```

### R3

```bash
R3#conf t
R3#router ospf 3
R3#router-id 1.1.3.3
R3#int lo 0
R3#ip ospf 3 area 2
R3#int lo 3
R3#ip ospf 3 area 2
R3#int e0/0
R3#ip ospf 3 area 2
```

R4

```bash
R4#conf t
R4#router ospf 4
R4#router-id 1.1.4.4
R4#int lo 0
R4#ip ospf 4 area 0
R4#int lo 4
R4#ip ospf 4 area 0
R4#int e0/0
R4#ip ospf 4 area 0
```

### R5

```bash
R5#conft 
R5#router ospf 5
R5#router-id 1.1.5.5
R5#int lo 0
R5#ip ospf 5 area 0
R5#int e0/0
R5#ip ospf 5 area 0
```



------

### static 설정

```bash
#ip route 1.1.1.1 255.255.255.255 e0/0
```

